{
  "races": {
    "data": {
      "Dwarf": {
        "name": "Dwarf",
        "features": [
          "Dwarven Toughness",
          "Dwarven Resilience",
          "Bulky"
        ],
        "proficiencies": [
          {
            "name": "Blunt Weapon",
            "level": "1"
          },
          {
            "name": "History",
            "level": "0"
          },
          {
            "name": "Common",
            "level": "0"
          },
          {
            "name": "Dwarvish",
            "level": " 0"
          }
        ],
        "ability_scores": {
          "strength": "1",
          "dexterity": "-1",
          "constitution": "1",
          "wisdom": "1",
          "intelligence": "0",
          "charisma": "1"
        },
        "description": "<i>Kingdoms rich in ancient grandeur, halls carved into the roots of mountains, the echoing of picks and hammers in deep mines and blazing forges, a commitment to clan and tradition, and a burning hatred of goblins and orcs – these common threads unite all dwarves.</i>\n\n<b>Age:</b> Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.\n\n<b>Alignment:</b> Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.\n\n<b>Size:</b> Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium."
      },
      "Half-Orc": {
        "name": "Half-Orc",
        "features": [
          "Savage Attacks",
          "Relentless Endurance"
        ],
        "proficiencies": [
          {
            "name": "Intimidation",
            "level": "0"
          },
          {
            "name": "Common",
            "level": "0"
          },
          {
            "name": "Orcish",
            "level": "0"
          }
        ],
        "ability_scores": {
          "strength": "2",
          "dexterity": "0",
          "constitution": "2",
          "wisdom": "-1",
          "intelligence": "-1",
          "charisma": "0"
        },
        "description": "<i>When alliances between humans and orcs are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other more civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric customs and savage fury.</i>\n\n<b>Age:</b> Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n\n<b>Alignment:</b> Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.\n\n<b>Size:</b> Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium."
      },
      "Elf": {
        "name": "Elf",
        "features": [
          "Fleet of Foot",
          "Darkvision",
          "Fey Ancestry",
          "Trance"
        ],
        "proficiencies": [
          {
            "name": "Sword",
            "level": "1"
          },
          {
            "name": "Perception",
            "level": "0"
          },
          {
            "name": "Common",
            "level": "0"
          },
          {
            "name": "Elven",
            "level": "0"
          }
        ],
        "ability_scores": {
          "strength": "0",
          "dexterity": "2",
          "constitution": "-1",
          "wisdom": "1",
          "intelligence": "1",
          "charisma": "0"
        },
        "description": "<i>Elves are a magical people of otherworldly grace, living in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry.</i>\n\n<b>Age:</b> Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n\n<b>Alignment:</b> Elves love freedom, variety, and self-expression, so they lean strongly towards the gentler aspects of chaos. They value and protect others' freedom as well as their own, and are good more often than not.\n\n<b>Size:</b> Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
      },
      "Human": {
        "name": "Human",
        "features": [
          "Extra Feat"
        ],
        "proficiencies": [
          {
            "name": "Common",
            "level": "0"
          },
          {
            "name": "Persuasion",
            "level": "0"
          }
        ],
        "ability_scores": {
          "strength": "1",
          "dexterity": "1",
          "constitution": "1",
          "wisdom": "1",
          "intelligence": "1",
          "charisma": "1"
        },
        "description": "<i>In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that's why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.</i>\n\n<b>Age:</b> Humans reach adulthood in their late teens and live less than a century.\n\n<b>Alignment:</b> Humans tend toward no particular alignment. The best and the worst are found among them.\n\n<b>Size:</b> Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
      },
      "Half-Elf": {
        "name": "Half-Elf",
        "features": [
          "Fey Ancestry",
          "Extra Feat"
        ],
        "proficiencies": [
          {
            "name": "Common",
            "level": "0"
          },
          {
            "name": "Elven",
            "level": "0"
          },
          {
            "name": "Performance",
            "level": "0"
          }
        ],
        "ability_scores": {
          "strength": "0",
          "dexterity": "1",
          "constitution": "0",
          "wisdom": "0",
          "intelligence": "1",
          "charisma": "1"
        },
        "description": "<i>Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves.</i>\n\n<b>Age:</b> Half-elves age at much the same rate as humans, reaching adulthood at the age of 20. They live much longer than humans, however, often exceeding 180 years.\n\n<b>Alignment:</b> Half-elves share the chaotic bent of their elven heritage. They both value personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable. They are good and evil in equal numbers, a trait they share with their human parents.\n\n<b>Size:</b> Half-elves are more or less the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium."
      }
    }
  },
  "proficiencies": {
    "data": {
      "Mundane Weapon": {
        "name": "Mundane Weapon",
        "type": "combat",
        "description": [
          "You are proficient with clubs, daggers, quarterstaffs, light crossbows, darts, and slings.",
          "",
          "",
          ""
        ]
      },
      "Simple Weapon": {
        "name": "Simple Weapon",
        "type": "combat",
        "description": [
          "You are proficient with clubs, daggers, greatclubs, handaxes, javelins, light hammers, maces, quarterstaffs, sickles, light crossbows, darts, shortbows, and slings.",
          "",
          "",
          ""
        ]
      },
      "Martial Weapon": {
        "name": "Martial Weapon",
        "type": "combat",
        "description": [
          "You are proficient with all polearms, swords, axes, blunt weapons, missile weapons, bows, and crossbows.",
          "",
          "",
          ""
        ]
      },
      "Crossbow": {
        "name": "Crossbow",
        "type": "combat",
        "description": [
          "You may gain bonuses to crossbows you are proficient with.",
          "Your attacks made with crossbows do not receive penalties from attacking in melee range.",
          "While wielding heavy crossbows, your attacks that would be blocked by armor, deal half damage instead.",
          ""
        ]
      },
      "Small Sword": {
        "name": "Small Sword",
        "type": "combat",
        "description": [
          "You may gain bonuses to small swords you are proficient with.",
          "While wielding small swords you can add your dexterity modifier as an additional bonus to damage against unnarmored or lightly armored enemies",
          "You gain the following bonuses when wielding the following small swords:\n\n- Shortsword: If all of your main hand attacks this round hit, you can make an additional attack\n\n- Dagger: Hits against grappled opponents are critical hits.",
          ""
        ]
      },
      "Polearm": {
        "name": "Polearm",
        "type": "combat",
        "description": [
          "You may gain bonuses to polearms you are proficient with.",
          "While wielding pikes, halberds, glaives, spears, and tridents you can make attacks of opportunity when opponents first step into your range, or when opponents within range make attack rolls against a creature other than you.",
          "You gain the following bonuses when wielding the following polearms:\n\n- Pike: If you move at least 10ft before making an attack, it deals an additional 1d10 damage\n\n- Halberd: Opportunity attacks force opponents on a DC STR check, knocking them down on a fail\n\n- Glaive: Your attacks can hit multiple targets, before making a weapon attack roll, you can choose to hit up to 2 adjacent enemies, the roll against the main target receives a -3 penalty, and the roll against the other targets receives a -6 penalty.\n\n- Spear / Trident: You can make two opportunity attacks per round",
          ""
        ]
      },
      "Blunt Weapon": {
        "name": "Blunt Weapon",
        "type": "combat",
        "description": [
          "You may gain bonuses to blunt weapons you are proficient with.",
          "While wielding mauls, warhammers, maces, and flails your attacks that would be blocked by metal armor, deal half damage instead",
          "You gain the following bonuses when wielding the following blunt weapons:\n\n- Maul: Your first hit on a round forces the opponent on a DC STR Check, on a fail they are stunned\n\n- Warhammer: Your first hit on a round forces the opponent on a DC STR Check, on a fail they are knocked down\n\n- Mace: Your first hit on a round forces the opponent on a DC STR Check, on a fail they are dazed\n\n- Flail: Your first hit on a round forces the opponent on a DC STR Check, on a fail they are disarmed",
          ""
        ]
      },
      "Axe": {
        "name": "Axe",
        "type": "combat",
        "description": [
          "You may gain bonuses to axes you are proficient with.",
          "While wielding greataxes and battleaxes your attacks that would be blocked by leather or hide armor, deal half damage instead",
          "You gain the following bonuses when wielding the following axes:\n\n- Greataxe: Your attacks can hit multiple targets, before making a weapon attack roll, you can choose to hit up to 2 adjacent enemies, the roll against the main target receives a -3 penalty, and the roll against the other targets receives a -6 penalty.\n\n- Battleaxe: Your first hit in combat against a shielded opponent forces them on a DC STR Check on a fail their shield is dropped to the ground.",
          ""
        ]
      },
      "Bow": {
        "name": "Bow",
        "type": "combat",
        "description": [
          "You may gain bonuses to bows you are proficient with.",
          "While wielding bows your attacks can hit multiple targets, before making a weapon attack roll, you can choose to hit up to 2 adjacent enemies, the roll against the main target receives a -3 penalty, and the roll against the other targets receives a -6 penalty.",
          "You gain the following bonuses when wielding the following bows:\n\n- Longbow: At the beginning of your round, you can choose to spend your movement, doing so allows you to add your dexterity modifier as a bonus to damage for the round.\n\n- Shortbow: Your recovery time is halved with shortbows.",
          ""
        ]
      },
      "Common": {
        "name": "Common",
        "type": "language",
        "description": [
          "You can understand, read, write, and speak this language.",
          "",
          "",
          ""
        ]
      },
      "Elven": {
        "name": "Elven",
        "type": "language",
        "description": [
          "You can understand, read, write, and speak this language.",
          "",
          "",
          ""
        ]
      },
      "Dwarvish": {
        "name": "Dwarvish",
        "type": "language",
        "description": [
          "You can understand, read, write, and speak this language.",
          "",
          "",
          ""
        ]
      },
      "Orcish": {
        "name": "Orcish",
        "type": "language",
        "description": [
          "You can understand, read, write, and speak this language.",
          "",
          "",
          ""
        ]
      },
      "Perception": {
        "name": "Perception",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Athletics": {
        "name": "Athletics",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Acrobatics": {
        "name": "Acrobatics",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Sleight of Hand": {
        "name": "Sleight of Hand",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Stealth": {
        "name": "Stealth",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Animal Handling": {
        "name": "Animal Handling",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Insight": {
        "name": "Insight",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Medicine": {
        "name": "Medicine",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Survival": {
        "name": "Survival",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Arcana": {
        "name": "Arcana",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "History": {
        "name": "History",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Investigation": {
        "name": "Investigation",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Nature": {
        "name": "Nature",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Religion": {
        "name": "Religion",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Deception": {
        "name": "Deception",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Intimidation": {
        "name": "Intimidation",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Performance": {
        "name": "Performance",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Persuasion": {
        "name": "Persuasion",
        "type": "skill",
        "description": [
          "You receive a bonus made to checks using this skill.",
          "",
          "",
          ""
        ]
      },
      "Sword": {
        "name": "Sword",
        "type": "combat",
        "description": [
          "You may gain bonuses to swords you are proficient with.",
          "While wielding swords you can make attacks of opportunity when opponents miss you with melee weapon attacks.",
          "You gain the following bonuses when wielding the following swords:\n\n- Greatsword: Your attacks can hit multiple targets, before making a weapon attack roll, you can choose to hit up to 2 adjacent enemies, the roll against the main target receives a -3 penalty, and the roll against the other targets receives a -6 penalty.\n\n- Longsword: You can use your weapon for thrusting, gaining the same bonus as small swords on those attacks.\n\n- Rapier: After attacking an opponent, your provoke no opportunity attacks from them.\n\n- Scimitar: You can make two opportunity attacks per round",
          ""
        ]
      }
    },
    "type": {
      "skill": [
        "Perception",
        "Athletics",
        "Acrobatics",
        "Sleight of Hand",
        "Stealth",
        "Animal Handling",
        "Insight",
        "Medicine",
        "Survival",
        "Arcana",
        "History",
        "Investigation",
        "Nature",
        "Religion",
        "Deception",
        "Intimidation",
        "Performance",
        "Persuasion"
      ],
      "weapon": [],
      "save": [],
      "tool": [],
      "combat": [
        "Mundane Weapon",
        "Simple Weapon",
        "Martial Weapon",
        "Crossbow",
        "Small Sword",
        "Polearm",
        "Blunt Weapon",
        "Axe",
        "Bow",
        "Sword"
      ],
      "undefined": [],
      "language": [
        "Common",
        "Elven",
        "Dwarvish",
        "Orcish"
      ]
    }
  },
  "conditions": {
    "data": {
      "Mage Armor": {
        "name": "Mage Armor",
        "type": "spell",
        "duration": "14400",
        "description": "A protective magical force surrounds you until the spell ends. Your base AC becomes 13 + your Dexterity modifier. The spell ends if you don armor."
      },
      "Rage": {
        "name": "Rage",
        "type": "special",
        "duration": "10",
        "description": "While raging, you gain the following benefits if you aren't wearing heavy armor:\n\n- You have advantage on Strength checks and Strength saving throws.\n\n- When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.\n\n- You have lesser resistance to bludgeoning, piercing, and slashing damage.\n\nIf you are able to cast spells, you can't cast them or concentrate on them while raging."
      }
    },
    "type": {
      "spell": [
        "Mage Armor"
      ],
      "special": [
        "Rage"
      ]
    }
  },
  "resources": {
    "data": {},
    "type": {},
    "level": {}
  },
  "damage_types": {
    "data": {
      "Lightning": {
        "name": "Lightning",
        "type": "elemental",
        "description": "Lightning damage crackles with raw energy, snapping through the air with a violent jolt. The electric current sears flesh, leaves marks, and leaves a ringing in the ears, as the air crackles with static.",
        "image": "asset://134583abf12f915d3277e7096ba22c09"
      },
      "Acid": {
        "name": "Acid",
        "type": "elemental",
        "description": "Acid damage corrodes and dissolves materials, leaving behind smoking remnants and searing wounds. The air fills with the acrid stench of sulfur, and whatever it touches seems to bubble and hiss in agony.",
        "image": "asset://2dec258f2f1c8012f4cf58b457fbd459"
      },
      "Cold": {
        "name": "Cold",
        "type": "elemental",
        "description": "Cold damage freezes and numbs, enshrouding the target in biting frost. The air becomes brittle, and frost crystals creep across surfaces, leaving behind icy scars and a deathly chill.",
        "image": "asset://3bec73de34380eaa439b63ed4a081909"
      },
      "Fire": {
        "name": "Fire",
        "type": "elemental",
        "description": "Fire damage burns with fierce, searing heat, scorching flesh and igniting materials in an inferno of destruction. The world around the flames warps and flickers, the air thick with smoke and the crackling of burning matter.",
        "image": "asset://daa543ebbb04f5cea92ea064656c85c6"
      },
      "Bludgeoning": {
        "name": "Bludgeoning",
        "type": "physical",
        "description": "Bludgeoning damage crushes and batters, leaving behind bruises, fractures, and broken bones. The impact resonates like thunder, as though the earth itself rises to meet the blow.",
        "image": "asset://5be7c85b6eff402cdd533bea7517d564"
      },
      "Piercing": {
        "name": "Piercing",
        "type": "physical",
        "description": "Piercing damage punctures and slices through the target, often leaving deep, narrow wounds. The damage is quick and precise, tearing through armor and flesh alike with ease.",
        "image": "asset://c99068f93e9cbec6a1e4fe64f8b0beb5"
      },
      "Slashing": {
        "name": "Slashing",
        "type": "physical",
        "description": "Slashing damage rends and tears, carving deep gashes into flesh and slicing through armor with unrelenting precision. The air hums with the sharp hiss of a blade's arc, leaving behind trails of blood and the jagged sting of exposed wounds. Each strike is a calculated savagery, a testament to the lethality of a honed edge.",
        "image": "asset://a5ecc68523b5c6a9f843de98879c2ed8"
      },
      "Force": {
        "name": "Force",
        "type": "special",
        "description": "Force damage is an unseen, pure energy that crushes and pushes with overwhelming power. It feels as though the very air itself is turned into a solid weight, compressing and flinging the target with devastating results.",
        "image": "asset://2957f07243eb79029f44c069481f4853"
      },
      "Psychic": {
        "name": "Psychic",
        "type": "special",
        "description": "Psychic damage assaults the mind directly, causing unbearable mental anguish and confusion. The target’s thoughts are twisted and torn, leaving them in a state of disorientation or madness.",
        "image": "asset://5f1eadd995ada478ae415d01039227aa"
      },
      "Radiant": {
        "name": "Radiant",
        "type": "special",
        "description": "Radiant damage shines with divine light, burning through darkness and evil with holy purity. It leaves behind a glowing mark, as though touched by the sun itself, dispelling shadows and healing wounds with its blinding light.",
        "image": "asset://c2fefa091fa0c48437731f0ad6944de5"
      },
      "Thunder": {
        "name": "Thunder",
        "type": "special",
        "description": "Thunder damage pulses with explosive sound waves, rattling the environment and causing concussive effects. The force reverberates through the air, stunning and deafening those caught in its path.",
        "image": "asset://8800aa11907a964e37390a68f3e4feb3"
      },
      "Necrotic": {
        "name": "Necrotic",
        "type": "special",
        "description": "Necrotic damage drains the life force, corrupting and decaying everything it touches. It leaves behind withered, gray skin and a deep, internal chill as it leeches vitality and vitality from its victims.",
        "image": "asset://e4038c86139ef7bb00ae7ede271aa5be"
      },
      "Poison": {
        "name": "Poison",
        "type": "special",
        "description": "Poison damage creeps insidiously through the body, corrupting and weakening from within. The target feels their strength ebb away as a vile, toxic force courses through their veins, overwhelming their natural defenses. The effects can range from excruciating pain to a slow, suffocating numbness that leaves the victim gasping for relief.",
        "image": "asset://91d630c543aa531518fbcecbf011042a"
      }
    },
    "type": {
      "physical": [
        "Bludgeoning",
        "Piercing",
        "Slashing"
      ],
      "elemental": [
        "Lightning",
        "Acid",
        "Cold",
        "Fire"
      ],
      "special": [
        "Force",
        "Psychic",
        "Radiant",
        "Thunder",
        "Necrotic",
        "Poison"
      ]
    }
  },
  "features": {
    "data": {
      "Sneak Attack": {
        "name": "Sneak Attack",
        "type": "class",
        "subtype": "rogue",
        "level": "1",
        "optional": "false",
        "description": "You know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n\nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.\n\nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table."
      },
      "Thieves' Cant": {
        "name": "Thieves' Cant",
        "type": "class",
        "subtype": "rogue",
        "level": "1",
        "optional": "false",
        "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n\nIn addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
      },
      "Cunning Action": {
        "name": "Cunning Action",
        "type": "class",
        "subtype": "rogue",
        "level": "2",
        "optional": "false",
        "description": "Your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
      },
      "Roguish Archetype": {
        "name": "Roguish Archetype",
        "type": "class",
        "subtype": "rogue",
        "level": "3",
        "optional": "false",
        "description": "You choose an archetype that you emulate in the exercise of your rogue abilities, such as Thief. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level."
      },
      "Ability Score Improvement": {
        "name": "Ability Score Improvement",
        "type": "feat",
        "level": "4",
        "optional": "true",
        "description": "When you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      "Uncanny Dodge": {
        "name": "Uncanny Dodge",
        "type": "class",
        "subtype": "rogue",
        "level": "5",
        "optional": "false",
        "description": "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
      },
      "Roguish Evasion": {
        "name": "Roguish Evasion",
        "type": "class",
        "subtype": "rogue",
        "level": "5",
        "optional": "false",
        "description": "You can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an Ice Storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
      },
      "Reliable Talent": {
        "name": "Reliable Talent",
        "type": "class",
        "subtype": "rogue",
        "level": "11",
        "optional": "false",
        "description": "You have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
      },
      "Rogue Blindsense": {
        "name": "Rogue Blindsense",
        "type": "class",
        "subtype": "rogue",
        "level": "14",
        "optional": "false",
        "description": "If you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
      },
      "Slippery Mind": {
        "name": "Slippery Mind",
        "type": "class",
        "subtype": "rogue",
        "level": "15",
        "optional": "false",
        "description": "You have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
      },
      "Elusive": {
        "name": "Elusive",
        "type": "class",
        "subtype": "rogue",
        "level": "18",
        "optional": "false",
        "description": "You are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated."
      },
      "Stroke of Luck": {
        "name": "Stroke of Luck",
        "type": "class",
        "subtype": "rogue",
        "level": "20",
        "optional": "false",
        "description": "You have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n"
      },
      "Barbarian Toughness": {
        "name": "Barbarian Toughness",
        "type": "class",
        "subtype": "barbarian",
        "level": "1",
        "optional": "false",
        "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
      },
      "Reckless Attack": {
        "name": "Reckless Attack",
        "type": "class",
        "subtype": "barbarian",
        "level": "2",
        "optional": "false",
        "description": "You can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
      },
      "Primal Path": {
        "name": "Primal Path",
        "type": "class",
        "subtype": "barbarian",
        "level": "3",
        "optional": "false",
        "description": "You choose a path that shapes the nature of your rage, such as the Path of the Berserker. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
      },
      "Extra Attack": {
        "name": "Extra Attack",
        "type": "class",
        "subtype": "",
        "level": "5",
        "optional": "false",
        "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
      },
      "Feral Instinct": {
        "name": "Feral Instinct",
        "type": "class",
        "subtype": "barbarian",
        "level": "7",
        "optional": "false",
        "description": "Your instincts are so honed that you have advantage on initiative rolls.\n\nAdditionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
      },
      "Relentless Rage": {
        "name": "Relentless Rage",
        "type": "class",
        "subtype": "barbarian",
        "level": "11",
        "optional": "false",
        "description": "Your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\n\nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
      },
      "Brutal Critical": {
        "name": "Brutal Critical",
        "type": "class",
        "subtype": "barbarian",
        "level": "9",
        "optional": "false",
        "description": "Your critical multiplier is increased by 1x when determining the extra damage for a critical hit with a melee attack.\n\nThis increases to an increase of 2x at 13th level and 3x at 17th level."
      },
      "Danger Sense": {
        "name": "Danger Sense",
        "type": "class",
        "subtype": "barbarian",
        "level": "2",
        "optional": "false",
        "description": "You gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
      },
      "Persistent Rage": {
        "name": "Persistent Rage",
        "type": "class",
        "subtype": "barbarian",
        "level": "15",
        "optional": "false",
        "description": "Your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
      },
      "Indomitable Might": {
        "name": "Indomitable Might",
        "type": "class",
        "subtype": "barbarian",
        "level": "18",
        "optional": "false",
        "description": "If your total for a Strength check is less than your Strength score, you can use that score in place of the total."
      },
      "Primal Champion": {
        "name": "Primal Champion",
        "type": "class",
        "subtype": "barbarian",
        "level": "20",
        "optional": "false",
        "description": "You embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
      },
      "Wizard Spellcasting": {
        "name": "Wizard Spellcasting",
        "type": "class",
        "subtype": "wizard",
        "level": "1",
        "optional": "false",
        "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power.\n\nCantrips\n\nAt 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table.\n\nSpellbook\n\nAt 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind.\n\nPreparing and Casting Spells\n\nThe Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell Magic Missile, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list.\n\nSpellcasting Ability\n\nIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Intelligence modifier\nSpell attack modifier = your proficiency bonus + your Intelligence modifier\n\nRitual Casting\n\nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared.\n\nSpellcasting Focus\n\nYou can use an arcane focus as a spellcasting focus for your wizard spells.\n\nLearning Spells of 1st Level and Higher\n\nEach time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook."
      },
      "Arcane Recovery": {
        "name": "Arcane Recovery",
        "type": "class",
        "subtype": "wizard",
        "level": "1",
        "optional": "false",
        "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
      },
      "Arcane Tradition": {
        "name": "Arcane Tradition",
        "type": "class",
        "subtype": "wizard",
        "level": "2",
        "optional": "false",
        "description": "You choose an arcane tradition, shaping your practice of magic through one of eight schools, such as Evocation. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
      },
      "Spell Mastery": {
        "name": "Spell Mastery",
        "type": "class",
        "subtype": "wizard",
        "level": "18",
        "optional": "false",
        "description": "You have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal.\n\nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
      },
      "Signature Spells": {
        "name": "Signature Spells",
        "type": "class",
        "subtype": "wizard",
        "level": "20",
        "optional": "false",
        "description": "You gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest.\n\nIf you want to cast either spell at a higher level, you must expend a spell slot as normal."
      },
      "Action Surge": {
        "name": "Action Surge",
        "type": "class",
        "subtype": "fighter",
        "level": "2",
        "optional": "false",
        "description": "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
      },
      "Martial Archetype": {
        "name": "Martial Archetype",
        "type": "class",
        "subtype": "fighter",
        "level": "3",
        "optional": "false",
        "description": "You choose an archetype that you strive to emulate in your combat styles and techniques, such as Champion. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
      },
      "Two Extra Attacks": {
        "name": "Two Extra Attacks",
        "type": "class",
        "subtype": "fighter",
        "level": "11",
        "optional": "false",
        "description": "You can attack thrice, instead of twice, whenever you take the Attack action on your turn."
      },
      "Three Extra Attacks": {
        "name": "Three Extra Attacks",
        "type": "class",
        "subtype": "fighter",
        "level": "20",
        "optional": "false",
        "description": "You can attack four times whenever you take the Attack action on your turn."
      },
      "Indomitable": {
        "name": "Indomitable",
        "type": "class",
        "subtype": "fighter",
        "level": "9",
        "optional": "false",
        "description": "You can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.\n\nYou can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
      },
      "Druid Spellcasting": {
        "name": "Druid Spellcasting",
        "type": "class",
        "subtype": "druid",
        "level": "1",
        "optional": "false",
        "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.\n\nCantrips\n\nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.\n\nPreparing and Casting Spells\n\nThe Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level ar 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\nSpellcasting Ability\n\nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\nSpell attack modifier = your proficiency bonus + your Wisdom modifier\n\nRitual Casting\n\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\nSpellcasting Focus\n\nYou can use a druidic focus as a spellcasting focus for your druid spells."
      },
      "Druid Circle": {
        "name": "Druid Circle",
        "type": "class",
        "subtype": "druid",
        "level": "2",
        "optional": "false",
        "description": "You choose to identify with a circle of druids, such as the Circle of the Land. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
      },
      "Beast Spells": {
        "name": "Beast Spells",
        "type": "class",
        "subtype": "druid",
        "level": "18",
        "optional": "false",
        "description": "You can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
      },
      "Sorcerer Spellcasting": {
        "name": "Sorcerer Spellcasting",
        "type": "class",
        "subtype": "sorcerer",
        "level": "1",
        "optional": "false",
        "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells.\n\nCantrips\n\nAt 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table.\n\nSpell Slots\n\nThe Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell Burning Hands and have a 1st-level and a 2nd-level spell slot available, you can cast Burning Hands using either slot.\n\nSpells Known of 1st Level and Higher\n\nYou know two 1st-level spells of your choice from the sorcerer spell list.\n\nYou learn an additional sorcerer spell of your choice at each level except 12th, 14th, 16th, 18th, 19th, and 20th. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots.\n\nSpellcasting Ability\n\nCharisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Charisma modifier\nSpell attack modifier = your proficiency bonus + your Charisma modifier\n\nSpellcasting Focus\n\nYou can use an arcane focus as a spellcasting focus for your sorcerer spells."
      },
      "Sorcerer Origin": {
        "name": "Sorcerer Origin",
        "type": "class",
        "subtype": "sorcerer",
        "level": "1",
        "optional": "false",
        "description": "Choose a sorcerous origin, which describes the source of your innate magical power, such as Draconic Bloodline.\n\nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."
      },
      "Font of Magic": {
        "name": "Font of Magic",
        "type": "class",
        "subtype": "sorcerer",
        "level": "2",
        "optional": "false",
        "description": "You tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.\n\nYou have 2 sorcery points, and you gain one additional point every time you level up, to a maximum of 20 at level 20. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest."
      },
      "Metamagic": {
        "name": "Metamagic",
        "type": "class",
        "subtype": "sorcerer",
        "level": "2",
        "optional": "false",
        "description": "You gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.\n\nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted."
      },
      "Sorcerous Restoration": {
        "name": "Sorcerous Restoration",
        "type": "class",
        "subtype": "sorcerer",
        "level": "20",
        "optional": "false",
        "description": "You regain half of your expended sorcery points whenever you finish a short rest."
      },
      "Wildshape": {
        "name": "Wildshape",
        "type": "class",
        "subtype": "druid",
        "level": "2",
        "optional": "false",
        "description": "You can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n\nYour game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n\nWhen you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n\nYou can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. \n\nTransforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\nYou retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. \n\nHowever, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n\nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. \n\nWorn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. \n\nYour equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. \n\nEquipment that merges with the form has no effect until you leave the form."
      },
      "Bardic Inspiration": {
        "name": "Bardic Inspiration",
        "type": "class",
        "subtype": "bard",
        "level": "1",
        "optional": "false",
        "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\n\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
      },
      "Bard Spellcasting": {
        "name": "Bard Spellcasting",
        "type": "class",
        "subtype": "bard",
        "level": "1",
        "optional": "false",
        "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations.\n\nCantrips\n\nYou know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table.\n\nSpell Slots\n\nThe Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell Cure Wounds and have a 1st-level and a 2nd-level spell slot available, you can cast Cure Wounds using either slot.\n\nSpells Known of 1st Level and Higher\n\nYou know four 1st-level spells of your choice from the bard spell list.\n\nThe Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots.\n\nSpellcasting Ability\n\nCharisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Charisma modifier\nSpell attack modifier = your proficiency bonus + your Charisma modifier\n\nRitual Casting\n\nYou can cast any bard spell you know as a ritual if that spell has the ritual tag.\n\nSpellcasting Focus\n\nYou can use a musical instrument (see \"Equipment\") as a spellcasting focus for your bard spells.\n"
      },
      "Jack of All Trades": {
        "name": "Jack of All Trades",
        "type": "class",
        "subtype": "bard",
        "level": "2",
        "optional": "false",
        "description": "You can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."
      },
      "Song of Rest": {
        "name": "Song of Rest",
        "type": "class",
        "subtype": "bard",
        "level": "2",
        "optional": "false",
        "description": "You can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points by spending Hit Dice at the end of the short rest, each of those creatures regains an extra 1d6 hit points.\n\nThe extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
      },
      "Bard College": {
        "name": "Bard College",
        "type": "class",
        "subtype": "bard",
        "level": "3",
        "optional": "false",
        "description": "You delve into the advanced techniques of a bard college of your choice, such as the College of Lore. Your choice grants you features at 3rd level and again at 6th and 14th level."
      },
      "Bard Expertise": {
        "name": "Bard Expertise",
        "type": "class",
        "subtype": "bard",
        "level": "3",
        "optional": "false",
        "description": "Choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 10th level, you can choose another two skill proficiencies to gain this benefit."
      },
      "Rogue Expertise": {
        "name": "Rogue Expertise",
        "type": "class",
        "subtype": "rogue",
        "level": "1",
        "optional": "false",
        "description": "Choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit."
      },
      "Font of Inspiration": {
        "name": "Font of Inspiration",
        "type": "class",
        "subtype": "bard",
        "level": "5",
        "optional": "false",
        "description": "You regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
      },
      "Countercharm": {
        "name": "Countercharm",
        "type": "class",
        "subtype": "bard",
        "level": "6",
        "optional": "false",
        "description": "You gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
      },
      "Magical Secrets": {
        "name": "Magical Secrets",
        "type": "class",
        "subtype": "bard",
        "level": "10",
        "optional": "false",
        "description": "You have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.\n\nThe chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.\n\nYou learn two additional spells from any class at 14th level and again at 18th level."
      },
      "Superior Inspiration": {
        "name": "Superior Inspiration",
        "type": "class",
        "subtype": "bard",
        "level": "20",
        "optional": "false",
        "description": "When you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
      },
      "Cleric Spellcasting": {
        "name": "Cleric Spellcasting",
        "type": "class",
        "subtype": "cleric",
        "level": "1",
        "optional": "false",
        "description": "As a conduit for divine power, you can cast cleric spells.\n\nCantrips\n\nAt 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.\n\nPreparing and Casting Spells\n\nThe Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\nSpellcasting Ability\n\nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\nSpell attack modifier = your proficiency bonus + your Wisdom modifier\n\nRitual Casting\n\nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\nSpellcasting Focus\n\nYou can use a holy symbol (see \"Equipment\") as a spellcasting focus for your cleric spells."
      },
      "Divine Domain": {
        "name": "Divine Domain",
        "type": "class",
        "subtype": "cleric",
        "level": "1",
        "optional": "false",
        "description": "Choose one domain related to your deity, such as Life. The Life domain is detailed at the end of the class description, and provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.\n\nDomain Spells\n\nEach domain has a list of spells-its domain spells-that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.\n\nIf you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
      },
      "Channel Divinity": {
        "name": "Channel Divinity",
        "type": "class",
        "subtype": "cleric",
        "level": "2",
        "optional": "false",
        "description": "You gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses."
      },
      "Channel Divinity: Turn Undead": {
        "name": "Channel Divinity: Turn Undead",
        "type": "class",
        "subtype": "cleric",
        "level": "2",
        "optional": "false",
        "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
      },
      "Destroy Undead": {
        "name": "Destroy Undead",
        "type": "class",
        "subtype": "cleric",
        "level": "5",
        "optional": "false",
        "description": "When an undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
      },
      "Divine Intervention": {
        "name": "Divine Intervention",
        "type": "class",
        "subtype": "cleric",
        "level": "10",
        "optional": "false",
        "description": "You can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required."
      },
      "Remarkable Athlete": {
        "name": "Remarkable Athlete",
        "type": "class",
        "subtype": "Champion",
        "level": "7",
        "optional": "false",
        "description": "You can add half your proficiency bonus (rounded up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus.\n\nIn addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier."
      },
      "Improved Critical": {
        "name": "Improved Critical",
        "type": "class",
        "subtype": "Champion",
        "level": "3",
        "optional": "false",
        "description": "Your weapon attacks's minimum roll for a critical hit is reduced by 1. It is reduced by a further 1 at level 15."
      },
      "Survivor": {
        "name": "Survivor",
        "type": "class",
        "subtype": "Champion",
        "level": "18",
        "optional": "false",
        "description": "You attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points."
      },
      "Combat Superiority": {
        "name": "Combat Superiority",
        "type": "class",
        "subtype": "Battle Master",
        "level": "3",
        "optional": "false",
        "description": "You learn maneuvers that are fueled by special dice called superiority dice.\n\nManeuvers. You learn three maneuvers of your choice. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack. You learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n\nSuperiority Dice. You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest. You gain another superiority die at 7th level and one more at 15th level.\n\nSaving Throws. Some of your maneuvers require your target to make a saving throw to resist the maneuver's effects. The saving throw DC is calculated as follows:\n\nManeuver save DC = 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)"
      },
      "Student of War": {
        "name": "Student of War",
        "type": "class",
        "subtype": "Battle Master",
        "level": "3",
        "optional": "false",
        "description": "You gain proficiency with one type of artisan's tools of your choice."
      },
      "Know Your Enemy": {
        "name": "Know Your Enemy",
        "type": "class",
        "subtype": "Battle Master",
        "level": "7",
        "optional": "false",
        "description": "If you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own. The DM tells you if the creature is your equal, superior, or inferior in regard to two of the following characteristics of your choice:\n\n- Strength score\n- Dexterity score\n- Constitution score\n- Armor Class\n- Current hit points\n- Total class levels, if any\n- Fighter class levels, if any"
      },
      "Relentless": {
        "name": "Relentless",
        "type": "class",
        "subtype": "Battle Master",
        "level": "15",
        "optional": "false",
        "description": "When you roll initiative and have no superiority dice remaining, you regain 1 superiority die."
      },
      "Eldritch Knight Spellcasting": {
        "name": "Eldritch Knight Spellcasting",
        "type": "class",
        "subtype": "Eldritch Knight",
        "level": "3",
        "optional": "false",
        "description": "You augment your martial prowess with the ability to cast spells.\n\nCantrips\nYou learn two cantrips of your choice from the wizard spell list. You learn an additional wizard cantrip of your choice at 10th level.\n\nSpell Slots\nThe Eldritch Knight Spellcasting table shows how many spell slots you have to cast your wizard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell Shield and have a 1st-level and a 2nd-level spell slot available, you can cast Shield using either slot.\n\nSpells Known of 1st Level and Higher\nYou know three 1st-level wizard spells of your choice, two of which you must choose from the abjuration and evocation spells on the wizard spell list.\n\nThe Spells Known column of the Eldritch Knight Spellcasting table shows when you learn more wizard spells of 1st level or higher. Each of these spells must be an abjuration or evocation spell of your choice, and must be of a level for which you have spell slots. For instance, when you reach 7th level in this class, you can learn one new spell of 1st or 2nd level.\n\nThe spells you learn at 8th, 14th, and 20th level can come from any school of magic.\n\nWhenever you gain a level in this class, you can replace one of the wizard spells you know with another spell of your choice from the wizard spell list. The new spell must be of a level for which you have spell slots, and it must be an abjuration or evocation spell, unless you're replacing the spell you gained at 3rd, 8th, 14th, or 20th level from any school of magic.\n\nSpellcasting Ability\nIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Intelligence modifier\n\nSpell attack modifier = your proficiency bonus + your Intelligence modifier"
      },
      "Weapon Bond": {
        "name": "Weapon Bond",
        "type": "class",
        "subtype": "Eldritch Knight",
        "level": "3",
        "optional": "false",
        "description": "You learn a ritual that creates a magical bond between yourself and one weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. The weapon must be within your reach throughout the ritual, at the conclusion of which you touch the weapon and forge the bond.\n\nOnce you have bonded a weapon to yourself, you can't be disarmed of that weapon unless you are incapacitated. If it is on the same plane of existence, you can summon that weapon as a bonus action on your turn, causing it to teleport instantly to your hand.\n\nYou can have up to two bonded weapons, but can summon only one at a time with your bonus action. If you attempt to bond with a third weapon, you must break the bond with one of the other two."
      },
      "War Magic": {
        "name": "War Magic",
        "type": "class",
        "subtype": "Eldritch Knight",
        "level": "7",
        "optional": "false",
        "description": "When you use your action to cast a spell, you can make one weapon attack as a bonus action."
      },
      "Eldritch Strike": {
        "name": "Eldritch Strike",
        "type": "class",
        "subtype": "Eldritch Knight",
        "level": "10",
        "optional": "false",
        "description": "You learn how to make your weapon strikes undercut a creature's resistance to your spells. When you hit a creature with a weapon attack, that creature has disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn."
      },
      "Arcane Charge": {
        "name": "Arcane Charge",
        "type": "class",
        "subtype": "Eldritch Knight",
        "level": "15",
        "optional": "false",
        "description": "You gain the ability to teleport up to 30 feet to an unoccupied space you can see when you use your Action Surge. You can teleport before or after the additional action."
      },
      "Monk Toughness": {
        "name": "Monk Toughness",
        "type": "class",
        "subtype": "monk",
        "level": "1",
        "optional": "false",
        "description": "While you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
      },
      "Martial Arts": {
        "name": "Martial Arts",
        "type": "class",
        "subtype": "monk",
        "level": "1",
        "optional": "false",
        "description": "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.\n\nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:\n\nYou can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\nYou can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\nWhen you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon on the Weapons page."
      },
      "Ki": {
        "name": "Ki",
        "type": "class",
        "subtype": "monk",
        "level": "2",
        "optional": "false",
        "description": "Your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.\n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:\n\nKi save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nFlurry of Blows. Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\nPatient Defense. You can spend 1 ki point to take the Dodge action as a bonus action on your turn.\nStep of the Wind. You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
      },
      "Monk Movement": {
        "name": "Monk Movement",
        "type": "class",
        "subtype": "monk",
        "level": "2",
        "optional": "false",
        "description": "Your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
      },
      "Deflect Missiles": {
        "name": "Deflect Missiles",
        "type": "class",
        "subtype": "monk",
        "level": "3",
        "optional": "false",
        "description": "You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with a range of 20/60 using the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
      },
      "Ki-Fueled Attack": {
        "name": "Ki-Fueled Attack",
        "type": "class",
        "subtype": "monk",
        "level": "3",
        "optional": "false",
        "description": "If you spend 1 ki point or more as part of your action on your turn, you can make one attack with an unarmed strike or a monk weapon as a bonus action before the end of the turn."
      },
      "Slow Fall": {
        "name": "Slow Fall",
        "type": "class",
        "subtype": "monk",
        "level": "4",
        "optional": "false",
        "description": "You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
      },
      "Quickened Healing": {
        "name": "Quickened Healing",
        "type": "class",
        "subtype": "monk",
        "level": "4",
        "optional": "false",
        "description": "As an action, you can spend 2 ki points and roll a Martial Arts die. You regain a number of hit points equal to the number rolled plus your proficiency bonus."
      },
      "Stunning Strike": {
        "name": "Stunning Strike",
        "type": "class",
        "subtype": "monk",
        "level": "5",
        "optional": "false",
        "description": "You can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn"
      },
      "Focused Aim": {
        "name": "Focused Aim",
        "type": "class",
        "subtype": "monk",
        "level": "5",
        "optional": "false",
        "description": "When you miss with an attack roll, you can spend 1 to 3 ki points to increase your attack roll by 2 for each of these ki points you spend, potentially turning the miss into a hit."
      },
      "Ki-Empowered Strikes": {
        "name": "Ki-Empowered Strikes",
        "type": "class",
        "subtype": "monk",
        "level": "6",
        "optional": "false",
        "description": "Your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
      },
      "Monk Evasion": {
        "name": "Monk Evasion",
        "type": "class",
        "subtype": "monk",
        "level": "7",
        "optional": "false",
        "description": "Your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
      },
      "Stillness of Mind": {
        "name": "Stillness of Mind",
        "type": "class",
        "subtype": "monk",
        "level": "7",
        "optional": "false",
        "description": "You can use your action to end one effect on yourself that is causing you to be charmed or frightened."
      },
      "Tongue of the Sun and the Moon": {
        "name": "Tongue of the Sun and the Moon",
        "type": "class",
        "subtype": "monk",
        "level": "13",
        "optional": "false",
        "description": "You learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
      },
      "Purity of Body": {
        "name": "Purity of Body",
        "type": "class",
        "subtype": "monk",
        "level": "10",
        "optional": "false",
        "description": "Your mastery of the ki flowing through you makes you immune to disease and poison."
      },
      "Diamond Soul": {
        "name": "Diamond Soul",
        "type": "class",
        "subtype": "monk",
        "level": "14",
        "optional": "false",
        "description": "Your mastery of ki grants you proficiency in all saving throws.\n\nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
      },
      "Timeless Body": {
        "name": "Timeless Body",
        "type": "class",
        "subtype": "monk",
        "level": "15",
        "optional": "false",
        "description": "Your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water."
      },
      "Empty Body": {
        "name": "Empty Body",
        "type": "class",
        "subtype": "monk",
        "level": "18",
        "optional": "false",
        "description": "You can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n\nAdditionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you."
      },
      "Perfect Self": {
        "name": "Perfect Self",
        "type": "class",
        "subtype": "monk",
        "level": "20",
        "optional": "false",
        "description": "When you roll for initiative and have no ki points remaining, you regain 4 ki points."
      },
      "Divine Sense": {
        "name": "Divine Sense",
        "type": "class",
        "subtype": "paladin",
        "level": "1",
        "optional": "false",
        "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the Hallow spell.\n\nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
      },
      "Lay on Hands": {
        "name": "Lay on Hands",
        "type": "class",
        "subtype": "paladin",
        "level": "1",
        "optional": "false",
        "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.\n\nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.\n\nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n\nThis feature has no effect on undead and constructs."
      },
      "Divine Smite": {
        "name": "Divine Smite",
        "type": "class",
        "subtype": "paladin",
        "level": "2",
        "optional": "false",
        "description": "When you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
      },
      "Paladin Spellcasting": {
        "name": "Paladin Spellcasting",
        "type": "class",
        "subtype": "paladin",
        "level": "2",
        "optional": "false",
        "description": "You have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does.\n\nPreparing and Casting Spells\nThe Paladin table shows how many spell slots you have to cast your paladin spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\nSpellcasting Ability\nCharisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Charisma modifier\n\nSpell attack modifier = your proficiency bonus + your Charisma modifier\n\nSpellcasting Focus\nYou can use a holy symbol as a spellcasting focus for your paladin spells."
      },
      "Divine Health": {
        "name": "Divine Health",
        "type": "class",
        "subtype": "paladin",
        "level": "3",
        "optional": "false",
        "description": "The divine magic flowing through you makes you immune to disease."
      },
      "Sacred Oath": {
        "name": "Sacred Oath",
        "type": "class",
        "subtype": "paladin",
        "level": "3",
        "optional": "false",
        "description": "You swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.\n\nOath Spells\nEach oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.\n\nIf you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you.\n\nChannel Divinity\nYour oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.\n\nWhen you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."
      },
      "Aura of Protection": {
        "name": "Aura of Protection",
        "type": "class",
        "subtype": "paladin",
        "level": "6",
        "optional": "false",
        "description": "Whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.\n\nAt 18th level, the range of this aura increases to 30 feet."
      },
      "Aura of Courage": {
        "name": "Aura of Courage",
        "type": "class",
        "subtype": "paladin",
        "level": "10",
        "optional": "false",
        "description": "You and friendly creatures within 10 feet of you can't be frightened while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet."
      },
      "Improved Divine Smite": {
        "name": "Improved Divine Smite",
        "type": "class",
        "subtype": "paladin",
        "level": "11",
        "optional": "false",
        "description": "You are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."
      },
      "Cleansing Touch": {
        "name": "Cleansing Touch",
        "type": "class",
        "subtype": "paladin",
        "level": "14",
        "optional": "false",
        "description": "You can use your action to end one spell on yourself or on one willing creature that you touch.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
      },
      "Canny": {
        "name": "Canny",
        "type": "class",
        "subtype": "ranger",
        "level": "1",
        "optional": "false",
        "description": "Choose one of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make using the chosen skill.\n\nYou can also speak, read, and write 2 additional languages of your choice."
      },
      "Roving": {
        "name": "Roving",
        "type": "class",
        "subtype": "ranger",
        "level": "6",
        "optional": "false",
        "description": "Your walking speed increases by 5, and you gain a climbing speed and a swimming speed equal to your walking speed."
      },
      "Tireless": {
        "name": "Tireless",
        "type": "class",
        "subtype": "ranger",
        "level": "10",
        "optional": "false",
        "description": "As an action, you can give yourself a number of temporary hit points equal to 1d8 + your Wisdom modifier (minimum of 1 temporary hit point). You can use this action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nIn addition, whenever you finish a short rest, your exhaustion level, if any, is decreased by 1."
      },
      "Ranger Spellcasting": {
        "name": "Ranger Spellcasting",
        "type": "class",
        "subtype": "ranger",
        "level": "2",
        "optional": "false",
        "description": "You have learned to use the magical essence of nature to cast spells, much as a druid does.\n\nSpell Slots\nThe Ranger table shows how many spell slots you have to cast your ranger spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell Animal Friendship and have a 1st-level and a 2nd-level spell slot available, you can cast Animal Friendship using either slot.\n\nSpells Known of 1st Level and Higher\nYou know two 1st-level spells of your choice from the ranger spell list.\n\nThe Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots.\n\nSpellcasting Ability\nWisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nSpell attack modifier = your proficiency bonus + your Wisdom modifier"
      },
      "Primeval Awareness": {
        "name": "Primeval Awareness",
        "type": "class",
        "subtype": "ranger",
        "level": "3",
        "optional": "false",
        "description": "You can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number."
      },
      "Ranger Conclave": {
        "name": "Ranger Conclave",
        "type": "class",
        "subtype": "ranger",
        "level": "3",
        "optional": "false",
        "description": "You choose to emulate the ideals and training of a ranger conclave. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."
      },
      "Land's Stride": {
        "name": "Land's Stride",
        "type": "class",
        "subtype": "ranger",
        "level": "8",
        "optional": "false",
        "description": "Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the Entangle spell."
      },
      "Nature's Veil": {
        "name": "Nature's Veil",
        "type": "class",
        "subtype": "ranger",
        "level": "10",
        "optional": "false",
        "description": "You draw on the powers of nature to hide yourself from view briefly. As a bonus action, you can magically become invisible, along with any equipment you are wearing or carrying, until the start of your next turn.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      "Vanish": {
        "name": "Vanish",
        "type": "class",
        "subtype": "ranger",
        "level": "14",
        "optional": "false",
        "description": "You can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
      },
      "Feral Senses": {
        "name": "Feral Senses",
        "type": "class",
        "subtype": "ranger",
        "level": "18",
        "optional": "false",
        "description": "You gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it.\n\nYou are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened."
      },
      "Favored Enemy": {
        "name": "Favored Enemy",
        "type": "class",
        "subtype": "ranger",
        "level": "1",
        "optional": "false",
        "description": "You have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.\n\nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.\n\nYou have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n\nWeapon attacks made to hit favored enemies gain a bonus to damage equal to your wisdom modifier.\n\nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures."
      },
      "Foe Slayer": {
        "name": "Foe Slayer",
        "type": "class",
        "subtype": "ranger",
        "level": "20",
        "optional": "false",
        "description": "You become an unparalleled hunter of your enemies. When attacking one of your favored enemies, you can add your wisdom modifier as a bonus to hit.\n\nAdittionally weapon attacks against favored foes deal an extra 1d8 damage."
      },
      "Otherwordly Patron": {
        "name": "Otherwordly Patron",
        "type": "class",
        "subtype": "warlock",
        "level": "1",
        "optional": "false",
        "description": "You have struck a bargain with an otherworldly being of your choice. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
      },
      "Pact Magic": {
        "name": "Pact Magic",
        "type": "class",
        "subtype": "warlock",
        "level": "1",
        "optional": "false",
        "description": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells.\n\nCantrips\nYou know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table.\n\nSpell Slots\nThe Warlock table shows how many spell slots you have to cast your warlock spells of 1st through 5th level. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.\n\nFor example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell witch bolt, you must spend one of those slots, and you cast it as a 3rd-level spell.\n\nSpells Known of 1st Level and Higher\nAt 1st level, you know two 1st-level spells of your choice from the warlock spell list.\n\nThe Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level or higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots.\n\nSpellcasting Ability\nCharisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Charisma modifier\n\nSpell attack modifier = your proficiency bonus + your Charisma modifier\n\nSpellcasting Focus\nYou can use an arcane focus as a spellcasting focus for your warlock spells."
      },
      "Eldritch Invocations": {
        "name": "Eldritch Invocations",
        "type": "class",
        "subtype": "warlock",
        "level": "2",
        "optional": "false",
        "description": "You gain two eldritch invocations of your choice. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. A level prerequisite refers to your level in this class.\n\nAdditionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level."
      },
      "Pact of the Blade": {
        "name": "Pact of the Blade",
        "type": "class",
        "subtype": "warlock",
        "level": "3",
        "optional": "true",
        "description": "You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nYour pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die\n\nYou can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest.\n\nYou can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks."
      },
      "Pact of the Chain": {
        "name": "Pact of the Chain",
        "type": "class",
        "subtype": "warlock",
        "level": "3",
        "optional": "true",
        "description": "You learn the find familiar spell and can cast it as a ritual. The spell doesn't count against your number of spells known.\n\nWhen you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite."
      },
      "Pact of the Tome": {
        "name": "Pact of the Tome",
        "type": "class",
        "subtype": "warlock",
        "level": "3",
        "optional": "true",
        "description": "Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class's spell list (the three needn't be from the same list). While the book is on your person, you can cast those cantrips at will. They don't count against your number of cantrips known. If they don't appear on the warlock spell list, they are nonetheless warlock spells for you.\n\nIf you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die."
      },
      "Pact of the Talisman": {
        "name": "Pact of the Talisman",
        "type": "class",
        "subtype": "warlock",
        "level": "3",
        "optional": "true",
        "description": "Your patron gives you an amulet, a talisman that can aid the wearer when the need is great. When the wearer fails an ability check, they can add a d4 to the roll, potentially turning the roll into a success. This benefit can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest.\n\nIf you lose the talisman, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous amulet. The talisman turns to ash when you die."
      },
      "Mystic Arcanum": {
        "name": "Mystic Arcanum",
        "type": "class",
        "subtype": "warlock",
        "level": "11",
        "optional": "true",
        "description": "Your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n\nYou can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.\n\nAt higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
      },
      "Eldritch Master": {
        "name": "Eldritch Master",
        "type": "class",
        "subtype": "warlock",
        "level": "20",
        "optional": "true",
        "description": "You can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
      },
      "Archdruid": {
        "name": "Archdruid",
        "type": "class",
        "subtype": "druid",
        "level": "20",
        "optional": "false",
        "description": "You can use your Wild Shape an unlimited number of times.\n\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
      },
      "Barbaric Movement": {
        "name": "Barbaric Movement",
        "type": "class",
        "subtype": "barbarian",
        "level": "5",
        "optional": "false",
        "description": "Your speed increases by 10 feet while you aren't wearing heavy armor."
      },
      "Darkvision": {
        "name": "Darkvision",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "You can see in dim light within 30 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      "Fleet of Foot": {
        "name": "Fleet of Foot",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "Your walking speed increases by 5ft"
      },
      "Fey Ancestry": {
        "name": "Fey Ancestry",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
      },
      "Trance": {
        "name": "Trance",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "Elves do not sleep. Instead they meditate deeply, remaining semi-conscious, for 4 hours a day. After resting in this way, you gain the same benefit a human would from 8 hours of sleep."
      },
      "Dwarven Toughness": {
        "name": "Dwarven Toughness",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "Your hit point maximum increases by 1 every time you gain a level."
      },
      "Dwarven Resilience": {
        "name": "Dwarven Resilience",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "Poison damage you receive is reduced by 10."
      },
      "Bulky": {
        "name": "Bulky",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "Your walking speed is reduced by 5ft"
      },
      "Savage Attacks": {
        "name": "Savage Attacks",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "When you score a critical hit with a melee weapon attack, the damage multiplier is increased by 1x."
      },
      "Relentless Endurance": {
        "name": "Relentless Endurance",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
      },
      "Extra Feat": {
        "name": "Extra Feat",
        "type": "racial",
        "level": "0",
        "optional": "false",
        "description": "You learn a new feat at level 1."
      },
      "Rage": {
        "name": "Rage",
        "type": "class",
        "subtype": "barbarian",
        "level": "1",
        "optional": "false",
        "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\n\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\n\n- You have advantage on Strength checks and Strength saving throws.\n\n- When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.\n\n- You have lesser resistance to bludgeoning, piercing, and slashing damage.\n\nIf you are able to cast spells, you can't cast them or concentrate on them while raging.\n\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n\nOnce you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th."
      }
    },
    "type": {
      "class": [
        "Barbarian Toughness",
        "Reckless Attack",
        "Danger Sense",
        "Primal Path",
        "Barbaric Movement",
        "Feral Instinct",
        "Brutal Critical",
        "Relentless Rage",
        "Persistent Rage",
        "Indomitable Might",
        "Primal Champion",
        "Bardic Inspiration",
        "Bard Spellcasting",
        "Jack of All Trades",
        "Song of Rest",
        "Bard College",
        "Bard Expertise",
        "Font of Inspiration",
        "Countercharm",
        "Magical Secrets",
        "Superior Inspiration",
        "Cleric Spellcasting",
        "Divine Domain",
        "Channel Divinity",
        "Channel Divinity: Turn Undead",
        "Destroy Undead",
        "Divine Intervention",
        "Druid Spellcasting",
        "Druid Circle",
        "Wildshape",
        "Beast Spells",
        "Archdruid",
        "Action Surge",
        "Martial Archetype",
        "Indomitable",
        "Two Extra Attacks",
        "Three Extra Attacks",
        "Improved Critical",
        "Remarkable Athlete",
        "Survivor",
        "Combat Superiority",
        "Student of War",
        "Know Your Enemy",
        "Relentless",
        "Eldritch Knight Spellcasting",
        "Weapon Bond",
        "War Magic",
        "Eldritch Strike",
        "Arcane Charge",
        "Monk Toughness",
        "Martial Arts",
        "Ki",
        "Monk Movement",
        "Deflect Missiles",
        "Ki-Fueled Attack",
        "Slow Fall",
        "Quickened Healing",
        "Stunning Strike",
        "Focused Aim",
        "Ki-Empowered Strikes",
        "Monk Evasion",
        "Stillness of Mind",
        "Purity of Body",
        "Tongue of the Sun and the Moon",
        "Diamond Soul",
        "Timeless Body",
        "Empty Body",
        "Perfect Self",
        "Divine Sense",
        "Lay on Hands",
        "Divine Smite",
        "Paladin Spellcasting",
        "Divine Health",
        "Sacred Oath",
        "Aura of Protection",
        "Aura of Courage",
        "Improved Divine Smite",
        "Cleansing Touch",
        "Canny",
        "Favored Enemy",
        "Ranger Spellcasting",
        "Primeval Awareness",
        "Ranger Conclave",
        "Roving",
        "Land's Stride",
        "Tireless",
        "Nature's Veil",
        "Vanish",
        "Feral Senses",
        "Foe Slayer",
        "Sneak Attack",
        "Thieves' Cant",
        "Rogue Expertise",
        "Cunning Action",
        "Roguish Archetype",
        "Uncanny Dodge",
        "Roguish Evasion",
        "Reliable Talent",
        "Rogue Blindsense",
        "Slippery Mind",
        "Elusive",
        "Stroke of Luck",
        "Sorcerer Spellcasting",
        "Sorcerer Origin",
        "Font of Magic",
        "Metamagic",
        "Sorcerous Restoration",
        "Otherwordly Patron",
        "Pact Magic",
        "Eldritch Invocations",
        "Pact of the Blade",
        "Pact of the Chain",
        "Pact of the Tome",
        "Pact of the Talisman",
        "Mystic Arcanum",
        "Eldritch Master",
        "Wizard Spellcasting",
        "Arcane Recovery",
        "Arcane Tradition",
        "Spell Mastery",
        "Signature Spells",
        "Extra Attack",
        "Rage"
      ],
      "feat": [
        "Ability Score Improvement"
      ],
      "": [],
      "racial": [
        "Darkvision",
        "Fleet of Foot",
        "Fey Ancestry",
        "Trance",
        "Dwarven Toughness",
        "Dwarven Resilience",
        "Bulky",
        "Savage Attacks",
        "Relentless Endurance",
        "Extra Feat"
      ]
    },
    "subtype": {
      "rogue": [
        "Sneak Attack",
        "Thieves' Cant",
        "Cunning Action",
        "Roguish Archetype",
        "Uncanny Dodge",
        "Roguish Evasion",
        "Reliable Talent",
        "Rogue Blindsense",
        "Slippery Mind",
        "Elusive",
        "Stroke of Luck",
        "Rogue Expertise"
      ],
      "barbarian": [
        "Barbarian Toughness",
        "Reckless Attack",
        "Primal Path",
        "Feral Instinct",
        "Relentless Rage",
        "Brutal Critical",
        "Danger Sense",
        "Persistent Rage",
        "Indomitable Might",
        "Primal Champion",
        "Barbaric Movement",
        "Rage"
      ],
      "undefined": [
        "Ability Score Improvement",
        "Darkvision",
        "Fleet of Foot",
        "Fey Ancestry",
        "Trance",
        "Dwarven Toughness",
        "Dwarven Resilience",
        "Bulky",
        "Savage Attacks",
        "Relentless Endurance",
        "Extra Feat"
      ],
      "sorcerer": [
        "Sorcerer Spellcasting",
        "Sorcerer Origin",
        "Font of Magic",
        "Metamagic",
        "Sorcerous Restoration"
      ],
      "": [
        "Extra Attack"
      ],
      "wizard": [
        "Wizard Spellcasting",
        "Arcane Recovery",
        "Arcane Tradition",
        "Spell Mastery",
        "Signature Spells"
      ],
      "fighter": [
        "Action Surge",
        "Martial Archetype",
        "Two Extra Attacks",
        "Three Extra Attacks",
        "Indomitable"
      ],
      "druid": [
        "Druid Spellcasting",
        "Druid Circle",
        "Beast Spells",
        "Wildshape",
        "Archdruid"
      ],
      "bard": [
        "Bardic Inspiration",
        "Bard Spellcasting",
        "Jack of All Trades",
        "Song of Rest",
        "Bard College",
        "Bard Expertise",
        "Font of Inspiration",
        "Countercharm",
        "Magical Secrets",
        "Superior Inspiration"
      ],
      "cleric": [
        "Cleric Spellcasting",
        "Divine Domain",
        "Channel Divinity",
        "Channel Divinity: Turn Undead",
        "Destroy Undead",
        "Divine Intervention"
      ],
      "path of the berserker": [],
      "Path of the Berserker": [],
      "Path of the Totem Warrior": [],
      "Champion": [
        "Remarkable Athlete",
        "Improved Critical",
        "Survivor"
      ],
      "Battle Master": [
        "Combat Superiority",
        "Student of War",
        "Know Your Enemy",
        "Relentless"
      ],
      "Eldritch Knight": [
        "Eldritch Knight Spellcasting",
        "Weapon Bond",
        "War Magic",
        "Eldritch Strike",
        "Arcane Charge"
      ],
      "monk": [
        "Monk Toughness",
        "Martial Arts",
        "Ki",
        "Monk Movement",
        "Deflect Missiles",
        "Ki-Fueled Attack",
        "Slow Fall",
        "Quickened Healing",
        "Stunning Strike",
        "Focused Aim",
        "Ki-Empowered Strikes",
        "Monk Evasion",
        "Stillness of Mind",
        "Tongue of the Sun and the Moon",
        "Purity of Body",
        "Diamond Soul",
        "Timeless Body",
        "Empty Body",
        "Perfect Self"
      ],
      "paladin": [
        "Divine Sense",
        "Lay on Hands",
        "Divine Smite",
        "Paladin Spellcasting",
        "Divine Health",
        "Sacred Oath",
        "Aura of Protection",
        "Aura of Courage",
        "Improved Divine Smite",
        "Cleansing Touch"
      ],
      "ranger": [
        "Canny",
        "Roving",
        "Tireless",
        "Ranger Spellcasting",
        "Primeval Awareness",
        "Ranger Conclave",
        "Land's Stride",
        "Nature's Veil",
        "Vanish",
        "Feral Senses",
        "Favored Enemy",
        "Foe Slayer"
      ],
      "warlock": [
        "Otherwordly Patron",
        "Pact Magic",
        "Eldritch Invocations",
        "Pact of the Blade",
        "Pact of the Chain",
        "Pact of the Tome",
        "Pact of the Talisman",
        "Mystic Arcanum",
        "Eldritch Master"
      ]
    },
    "level": {
      "0": [
        "Darkvision",
        "Fleet of Foot",
        "Fey Ancestry",
        "Trance",
        "Dwarven Toughness",
        "Dwarven Resilience",
        "Bulky",
        "Savage Attacks",
        "Relentless Endurance",
        "Extra Feat"
      ],
      "1": [
        "Sneak Attack",
        "Thieves' Cant",
        "Barbarian Toughness",
        "Wizard Spellcasting",
        "Arcane Recovery",
        "Druid Spellcasting",
        "Sorcerer Spellcasting",
        "Sorcerer Origin",
        "Bardic Inspiration",
        "Bard Spellcasting",
        "Rogue Expertise",
        "Cleric Spellcasting",
        "Divine Domain",
        "Monk Toughness",
        "Martial Arts",
        "Divine Sense",
        "Lay on Hands",
        "Canny",
        "Favored Enemy",
        "Otherwordly Patron",
        "Pact Magic",
        "Rage"
      ],
      "2": [
        "Cunning Action",
        "Reckless Attack",
        "Danger Sense",
        "Arcane Tradition",
        "Action Surge",
        "Druid Circle",
        "Font of Magic",
        "Metamagic",
        "Wildshape",
        "Jack of All Trades",
        "Song of Rest",
        "Channel Divinity",
        "Channel Divinity: Turn Undead",
        "Ki",
        "Monk Movement",
        "Divine Smite",
        "Paladin Spellcasting",
        "Ranger Spellcasting",
        "Eldritch Invocations"
      ],
      "3": [
        "Roguish Archetype",
        "Primal Path",
        "Martial Archetype",
        "Bard College",
        "Bard Expertise",
        "Improved Critical",
        "Combat Superiority",
        "Student of War",
        "Eldritch Knight Spellcasting",
        "Weapon Bond",
        "Deflect Missiles",
        "Ki-Fueled Attack",
        "Divine Health",
        "Sacred Oath",
        "Primeval Awareness",
        "Ranger Conclave",
        "Pact of the Blade",
        "Pact of the Chain",
        "Pact of the Tome",
        "Pact of the Talisman"
      ],
      "4": [
        "Ability Score Improvement",
        "Slow Fall",
        "Quickened Healing"
      ],
      "5": [
        "Uncanny Dodge",
        "Roguish Evasion",
        "Extra Attack",
        "Font of Inspiration",
        "Destroy Undead",
        "Stunning Strike",
        "Focused Aim",
        "Barbaric Movement"
      ],
      "6": [
        "Countercharm",
        "Ki-Empowered Strikes",
        "Aura of Protection",
        "Roving"
      ],
      "7": [
        "Feral Instinct",
        "Remarkable Athlete",
        "Know Your Enemy",
        "War Magic",
        "Monk Evasion",
        "Stillness of Mind"
      ],
      "8": [
        "Land's Stride"
      ],
      "9": [
        "Brutal Critical",
        "Indomitable"
      ],
      "10": [
        "Magical Secrets",
        "Divine Intervention",
        "Eldritch Strike",
        "Purity of Body",
        "Aura of Courage",
        "Tireless",
        "Nature's Veil"
      ],
      "11": [
        "Reliable Talent",
        "Relentless Rage",
        "Two Extra Attacks",
        "Improved Divine Smite",
        "Mystic Arcanum"
      ],
      "13": [
        "Tongue of the Sun and the Moon"
      ],
      "14": [
        "Rogue Blindsense",
        "Diamond Soul",
        "Cleansing Touch",
        "Vanish"
      ],
      "15": [
        "Slippery Mind",
        "Persistent Rage",
        "Relentless",
        "Arcane Charge",
        "Timeless Body"
      ],
      "18": [
        "Elusive",
        "Indomitable Might",
        "Spell Mastery",
        "Beast Spells",
        "Survivor",
        "Empty Body",
        "Feral Senses"
      ],
      "20": [
        "Stroke of Luck",
        "Primal Champion",
        "Signature Spells",
        "Three Extra Attacks",
        "Sorcerous Restoration",
        "Superior Inspiration",
        "Perfect Self",
        "Foe Slayer",
        "Eldritch Master",
        "Archdruid"
      ],
      "": []
    },
    "optional": {
      "false": [
        "Sneak Attack",
        "Thieves' Cant",
        "Cunning Action",
        "Roguish Archetype",
        "Uncanny Dodge",
        "Roguish Evasion",
        "Reliable Talent",
        "Rogue Blindsense",
        "Slippery Mind",
        "Elusive",
        "Stroke of Luck",
        "Barbarian Toughness",
        "Reckless Attack",
        "Primal Path",
        "Extra Attack",
        "Feral Instinct",
        "Relentless Rage",
        "Brutal Critical",
        "Danger Sense",
        "Persistent Rage",
        "Indomitable Might",
        "Primal Champion",
        "Wizard Spellcasting",
        "Arcane Recovery",
        "Arcane Tradition",
        "Spell Mastery",
        "Signature Spells",
        "Action Surge",
        "Martial Archetype",
        "Two Extra Attacks",
        "Three Extra Attacks",
        "Indomitable",
        "Druid Spellcasting",
        "Druid Circle",
        "Beast Spells",
        "Sorcerer Spellcasting",
        "Sorcerer Origin",
        "Font of Magic",
        "Metamagic",
        "Sorcerous Restoration",
        "Wildshape",
        "Bardic Inspiration",
        "Bard Spellcasting",
        "Jack of All Trades",
        "Song of Rest",
        "Bard College",
        "Bard Expertise",
        "Rogue Expertise",
        "Font of Inspiration",
        "Countercharm",
        "Magical Secrets",
        "Superior Inspiration",
        "Cleric Spellcasting",
        "Divine Domain",
        "Channel Divinity",
        "Channel Divinity: Turn Undead",
        "Destroy Undead",
        "Divine Intervention",
        "Remarkable Athlete",
        "Improved Critical",
        "Survivor",
        "Combat Superiority",
        "Student of War",
        "Know Your Enemy",
        "Relentless",
        "Eldritch Knight Spellcasting",
        "Weapon Bond",
        "War Magic",
        "Eldritch Strike",
        "Arcane Charge",
        "Monk Toughness",
        "Martial Arts",
        "Ki",
        "Monk Movement",
        "Deflect Missiles",
        "Ki-Fueled Attack",
        "Slow Fall",
        "Quickened Healing",
        "Stunning Strike",
        "Focused Aim",
        "Ki-Empowered Strikes",
        "Monk Evasion",
        "Stillness of Mind",
        "Tongue of the Sun and the Moon",
        "Purity of Body",
        "Diamond Soul",
        "Timeless Body",
        "Empty Body",
        "Perfect Self",
        "Divine Sense",
        "Lay on Hands",
        "Divine Smite",
        "Paladin Spellcasting",
        "Divine Health",
        "Sacred Oath",
        "Aura of Protection",
        "Aura of Courage",
        "Improved Divine Smite",
        "Cleansing Touch",
        "Canny",
        "Roving",
        "Tireless",
        "Ranger Spellcasting",
        "Primeval Awareness",
        "Ranger Conclave",
        "Land's Stride",
        "Nature's Veil",
        "Vanish",
        "Feral Senses",
        "Favored Enemy",
        "Foe Slayer",
        "Otherwordly Patron",
        "Pact Magic",
        "Eldritch Invocations",
        "Archdruid",
        "Barbaric Movement",
        "Darkvision",
        "Fleet of Foot",
        "Fey Ancestry",
        "Trance",
        "Dwarven Toughness",
        "Dwarven Resilience",
        "Bulky",
        "Savage Attacks",
        "Relentless Endurance",
        "Extra Feat",
        "Rage"
      ],
      "true": [
        "Ability Score Improvement",
        "Pact of the Blade",
        "Pact of the Chain",
        "Pact of the Tome",
        "Pact of the Talisman",
        "Mystic Arcanum",
        "Eldritch Master"
      ]
    }
  },
  "spells": {
    "data": {
      "Misty Step": {
        "name": "Misty Step",
        "level": "2nd",
        "school": "conjuration",
        "classes": [
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": 2,
        "range": 30,
        "target": "Self",
        "components": [
          "vocal"
        ],
        "duration": 0,
        "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.",
        "description_higher_levels": ""
      },
      "Eldritch Blast": {
        "name": "Eldritch Blast",
        "level": "cantrip",
        "school": "evocation",
        "classes": [
          "warlock"
        ],
        "cast_time": "1",
        "range": "60",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "0",
        "description": "A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d8 force damage. The damage dealt by this spell is increased by your spellcasting modifier.",
        "description_higher_levels": "The spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam."
      },
      "Fire Bolt": {
        "name": "Fire Bolt",
        "level": "cantrip",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "1",
        "range": "60",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "0",
        "description": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d6 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried. The damage dealt by this spell is increased by your spellcasting modifier.",
        "description_higher_levels": ""
      },
      "Lightning Streak": {
        "name": "Lightning Streak",
        "level": "cantrip",
        "school": "evocation",
        "classes": [
          "druid",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "30",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "0",
        "description": "Lightning jumps from your hand to a target within range, the target must succeed on a DC 10 + your spell modifier, on a fail the target receives 1d4 lightning damage, and the lightning jumps to the closest creature within 15ft. \n\nThe lightning can't jump twice on the same creature, and will only stop on a successful saving throw, or if there are no more creatures within range.\n\nThe damage dealt by this spell is increased by your spellcasting modifier.",
        "description_higher_levels": ""
      },
      "Ray of Frost": {
        "name": "Ray of Frost",
        "level": "cantrip",
        "school": "conjuration",
        "classes": [
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "2",
        "range": "30",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "1",
        "description": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d4 cold damage, and its speed is halved until the start of your next turn. The damage dealt by this spell is increased by your spellcasting modifier.",
        "description_higher_levels": ""
      },
      "Light": {
        "name": "Light",
        "level": "cantrip",
        "school": "conjuration",
        "classes": [
          "bard",
          "cleric",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "6",
        "range": "touch",
        "target": "One object that is no larger than 10 feet in any dimension",
        "components": [
          "vocal",
          "material"
        ],
        "duration": "600",
        "description": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.\n\nIf you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity DC of 10 + your spell modifier to avoid the spell.",
        "description_higher_levels": ""
      },
      "Imbue Weapon": {
        "name": "Imbue Weapon",
        "level": "cantrip",
        "school": "transmutation",
        "classes": [
          "druid",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "3",
        "range": "touch",
        "target": "One weapon",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "10",
        "description": "You touch a weapon you or a willing creature holds. Until the spell ends, the weapon is imbued with an element of your choice of either fire, cold or lightning. The spell ends if you cast it again or dismiss it as an action.\n\nWhile the spell is in effect, the imbued weapon does additional damage equal to your spellcasting modifier.",
        "description_higher_levels": ""
      },
      "Shield": {
        "name": "Shield",
        "level": "1st",
        "school": "abjuration",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "1",
        "description": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +3 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
        "description_higher_levels": "The bonus of this spell is increased by +1 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Magic Missile": {
        "name": "Magic Missile",
        "level": "1st",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "60",
        "target": "One or more creatures within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "0",
        "description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.",
        "description_higher_levels": "This spell can create one additional missile when your spellcasting level reaches: 3, 5, and 7."
      },
      "Hold Person": {
        "name": "Hold Person",
        "level": "2nd",
        "school": "enchantment",
        "classes": [
          "bard",
          "druid",
          "cleric",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "9",
        "range": "60",
        "target": "A humanoid that you can see within range",
        "components": [
          "vocal",
          "somatic",
          "material",
          "concentration"
        ],
        "duration": "10",
        "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
        "description_higher_levels": "This spell can target one additional humanoid when your spellcasting level reaches: 5, 7, and 9."
      },
      "Hold Monster": {
        "name": "Hold Monster",
        "level": "5th",
        "school": "enchantment",
        "classes": [
          "bard",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "9",
        "range": "90",
        "target": "A creature that you can see within range",
        "components": [
          "vocal",
          "somatic",
          "material",
          "concentration"
        ],
        "duration": "10",
        "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
        "description_higher_levels": "This spell can target one additional creature when your spellcasting level reaches: 11, 13, and 15."
      },
      "Blur": {
        "name": "Blur",
        "level": "2nd",
        "school": "illusion",
        "classes": [
          "bard",
          "cleric",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "self",
        "target": "One creature within range",
        "components": [
          "vocal"
        ],
        "duration": "10",
        "description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight.",
        "description_higher_levels": ""
      },
      "Invisibility": {
        "name": "Invisibility",
        "level": "2nd",
        "school": "illusion",
        "classes": [
          "bard",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "6",
        "range": "touch",
        "target": "One creature within range",
        "components": [
          "vocal",
          "somatic",
          "material",
          "concentration"
        ],
        "duration": "600",
        "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.",
        "description_higher_levels": "This spell can target one additional creature when your spellcasting level reaches: 5, 7, and 9."
      },
      "Sleep": {
        "name": "Sleep",
        "level": "1st",
        "school": "enchantment",
        "classes": [
          "bard",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "6",
        "range": "90",
        "target": "Creatures within a 20-foot radius of a point",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "10",
        "description": "This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).",
        "description_higher_levels": "The dies rolled by this spell are increased by 2d8 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Detect Magic": {
        "name": "Detect Magic",
        "level": "1st",
        "school": "divination",
        "classes": [
          "bard",
          "druid",
          "cleric",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "9",
        "range": "self",
        "target": "The caster and an area within 30 feet",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "100",
        "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.",
        "description_higher_levels": ""
      },
      "Blindness/Deafness": {
        "name": "Blindness/Deafness",
        "level": "2nd",
        "school": "necromancy",
        "classes": [
          "bard",
          "cleric",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "6",
        "range": "30",
        "target": "One creature within range",
        "components": [
          "vocal"
        ],
        "duration": "10",
        "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends.",
        "description_higher_levels": "This spell can target one additional creature when your spellcasting level reaches: 5, 7, and 9."
      },
      "Animate Dead": {
        "name": "Animate Dead",
        "level": "3rd",
        "school": "necromancy",
        "classes": [
          "cleric",
          "wizard"
        ],
        "cast_time": "9",
        "range": "10",
        "target": "One or more corpses within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "14400",
        "description": "This spell creates undead servants. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature.",
        "description_higher_levels": "This spell can target two additional creatures when your spellcasting level reaches: 7, 9, and 11."
      },
      "Polymorph": {
        "name": "Polymorph",
        "level": "4th",
        "school": "transmutation",
        "classes": [
          "bard",
          "druid",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "12",
        "range": "60",
        "target": "One creature",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "600",
        "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. The transformation lasts for the duration, or until the target drops to 0 hit points or dies.",
        "description_higher_levels": ""
      },
      "Fireball": {
        "name": "Fireball",
        "level": "3rd",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "150",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot radius sphere centered on that point must make a Dexterity saving throw. A target takes 6d6 fire damage on a failed save,  or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.",
        "description_higher_levels": "The damage of this spell is increased by 2d6 when your spellcasting level reaches: 7, 9, and 11."
      },
      "Snilloc's Snowball Swarm": {
        "name": "Snilloc's Snowball Swarm",
        "level": "2nd",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "90",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "A flurry of magic snowballs erupts from a point you choose within range. Each creature in a 15-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes 3d6 cold damage on a failed save, or half as much damage on a successful one.",
        "description_higher_levels": "The damage of this spell is increased by 1d6 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Rime's Binding Ice": {
        "name": "Rime's Binding Ice",
        "level": "2nd",
        "school": "conjuration",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "15",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "A burst of cold energy emanates from you in a 15-foot cone. Each creature in that area must make a Constitution saving throw. On a failed save, a creature takes 3d6 cold damage and is hindered by ice formations for 1 minute, or until it or another creature within reach of it uses an action to break away the ice. A creature hindered by ice has its speed reduced to 0. On a successful save, a creature takes half as much damage and isn’t hindered by ice.",
        "description_higher_levels": "The damage of this spell is increased by 1d6 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Mirror Image": {
        "name": "Mirror Image",
        "level": "2nd",
        "school": "illusion",
        "classes": [
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "3",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "10",
        "description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it’s impossible to track which image is real. You can use your action to dismiss the illusory duplicates.\n\nEach time a creature targets you with an attack during the spell’s duration, roll a d20 to determine whether the attack instead targets one of your duplicates.\n\nIf you have three duplicates, you must roll a 6 or higher to change the attack’s target to a duplicate. With two duplicates, you must roll an 8 or higher. With one duplicate, you must roll an 11 or higher.\n\nA duplicate’s AC equals 10 + your Dexterity modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that hits it. It ignores all other damage and effects. The spell ends when all three duplicates are destroyed.\n\nA creature is unaffected by this spell if it can’t see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false, as with truesight.",
        "description_higher_levels": ""
      },
      "Aganazzar's Scorcher": {
        "name": "Aganazzar's Scorcher",
        "level": "2nd",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "30",
        "target": "A point within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.",
        "description_higher_levels": "The damage of this spell is increased by 1d8 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Darkvision": {
        "name": "Darkvision",
        "level": "2nd",
        "school": "transmutation",
        "classes": [
          "druid",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "9",
        "range": "touch",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "4800",
        "description": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 30 feet.",
        "description_higher_levels": ""
      },
      "See Invisibility": {
        "name": "See Invisibility",
        "level": "2nd",
        "school": "divination",
        "classes": [
          "bard",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "600",
        "description": "For the duration, you see invisible creatures and objects as if they were visible, and you can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent.",
        "description_higher_levels": ""
      },
      "Major Image": {
        "name": "Major Image",
        "level": "3rd",
        "school": "illusion",
        "classes": [
          "bard",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "3",
        "range": "120",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material",
          "concentration"
        ],
        "duration": "100",
        "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).\n\nAs long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.\n\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.",
        "description_higher_levels": ""
      },
      "Permanent Image": {
        "name": "Permanent Image",
        "level": "6th",
        "school": "illusion",
        "classes": [
          "bard",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "cast_time": "3",
        "range": "120",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).\n\nAs long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.\n\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.",
        "description_higher_levels": ""
      },
      "Melf's Minute Meteors": {
        "name": "Melf's Minute Meteors",
        "level": "3rd",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "9",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "100",
        "description": "You create six tiny meteors in your space. They float in the air and orbit you for the spell’s duration. When you cast the spell — and as a bonus action on each of your turns thereafter — you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.",
        "description_higher_levels": "The number of meteors increases by two when your spellcasting level reaches: 7, 9, and 11."
      },
      "Intellect Fortress": {
        "name": "Intellect Fortress",
        "level": "3rd",
        "school": "abjuration",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "9",
        "range": "30",
        "target": "A creature within range",
        "components": [
          "vocal"
        ],
        "duration": "100",
        "description": "For the duration, you or one willing creature you can see within range has resistance to psychic damage, as well as advantage on Intelligence, Wisdom, and Charisma saving throws.",
        "description_higher_levels": "This spell can target one additional creature when your spellcasting level reaches: 7, 9, and 11."
      },
      "Glyph of Warding": {
        "name": "Glyph of Warding",
        "level": "3rd",
        "school": "abjuration",
        "classes": [
          "bard",
          "cleric",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "12",
        "range": "touch",
        "target": "A point within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "When you cast this spell, you inscribe a glyph that creates a magical effect triggered by other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.\n\nThe glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.\n\nYou decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.\n\nYou can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don’t trigger the glyph, such as those who say a certain password.\n\nWhen you inscribe the glyph, choose explosive runes or a spell glyph.\n\nExplosive Runes. When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one.\n\nSpell Glyph. You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration.",
        "description_higher_levels": "This damage of this spell increases by 1d8, and the level of spells of which it can hold increases by a level when your spellcasting level reaches: 7, 9, and 11."
      },
      "Haste": {
        "name": "Haste",
        "level": "3rd",
        "school": "transmutation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "9",
        "range": "30",
        "target": "A creature within range",
        "components": [
          "vocal",
          "somatic",
          "material",
          "concentration"
        ],
        "duration": "5",
        "description": "Choose a willing creature that you can see within range. Until the spell ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns.\n\nWhen the spell ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it.",
        "description_higher_levels": ""
      },
      "Absorb Elements": {
        "name": "Absorb Elements",
        "level": "1st",
        "school": "abjuration",
        "classes": [
          "druid",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "self",
        "target": "The caster",
        "components": [
          "somatic"
        ],
        "duration": "1",
        "description": "You can cast this spell as a reaction when taking acid, cold, fire, lightning or thunder damage.\n\nThe spell captures some of the incoming energy, lessening its effect on you. You have a resistance of 10 to the triggering damage type until the start of your next turn.",
        "description_higher_levels": "The resistance granted by this spell is increased by 10 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Burning Hands": {
        "name": "Burning Hands",
        "level": "1st",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "15",
        "target": "A point within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "0",
        "description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.\n\nThe fire ignites any flammable objects in the area that aren’t being worn or carried.",
        "description_higher_levels": "The damage of this spell increases by 1d6 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Disguise Self": {
        "name": "Disguise Self",
        "level": "1st",
        "school": "illusion",
        "classes": [
          "bard",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "6",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "600",
        "description": "You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\n\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
        "description_higher_levels": ""
      },
      "Mage Armor": {
        "name": "Mage Armor",
        "level": "1st",
        "school": "abjuration",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "9",
        "range": "touch",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "4800",
        "description": "You touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.",
        "description_higher_levels": ""
      },
      "Magnify Gravity": {
        "name": "Magnify Gravity",
        "level": "1st",
        "school": "transmutation",
        "classes": [
          "wizard"
        ],
        "cast_time": "6",
        "range": "60",
        "target": "A point within range",
        "components": [
          "vocal",
          "somatic"
        ],
        "duration": "1",
        "description": "The gravity in a 10-foot-radius sphere centered on a point you can see within range increases for a moment. Each creature in the sphere on the turn when you cast the spell must make a Constitution saving throw. On a failed save, a creature takes 2d6 force damage, and its speed is halved until the end of its next turn. On a successful save, a creature takes half as much damage and suffers no reduction to its speed.\n\nUntil the start of your next turn, any object that isn't being worn or carried in the sphere requires a successful Strength check against your spell save DC to pick up or move.",
        "description_higher_levels": "The damage of this spell is increased by 1d6 when your spellcasting level reaches: 3, 5, and 7."
      },
      "Detect Thoughts": {
        "name": "Detect Thoughts",
        "level": "2nd",
        "school": "divination",
        "classes": [
          "bard",
          "sorcerer",
          "wizard"
        ],
        "cast_time": "1",
        "range": "self",
        "target": "The caster",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "10",
        "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected.\n\nYou initially learn the surface thoughts of the creature - what is most on its mind in that moment. As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature’s thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends.\n\nQuestions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation.\n\nYou can also use this spell to detect the presence of thinking creatures you can’t see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can’t detect a creature with an Intelligence of 3 or lower or one that doesn’t speak any language.\n\nOnce you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can’t see it, but it must still be within range.",
        "description_higher_levels": ""
      },
      "Lightning Bolt": {
        "name": "Lightning Bolt",
        "level": "3rd",
        "school": "evocation",
        "classes": [
          "sorcerer",
          "wizard"
        ],
        "cast_time": "3",
        "range": "100",
        "target": "A point you choose within range",
        "components": [
          "vocal",
          "somatic",
          "material"
        ],
        "duration": "0",
        "description": "A stroke of lightning forming a line of 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 9d6 lightning damage on a failed save, or half as much damage on a successful one.\n\nThe lightning ignites flammable objects in the area that aren’t being worn or carried.",
        "description_higher_levels": "The damage of this spell is increased by 1d6 when your spellcasting level reaches: 7, 9, and 11."
      }
    },
    "level": {
      "cantrip": [
        "Eldritch Blast",
        "Fire Bolt",
        "Lightning Streak",
        "Ray of Frost",
        "Light",
        "Imbue Weapon"
      ],
      "1st": [
        "Shield",
        "Magic Missile",
        "Sleep",
        "Detect Magic",
        "Absorb Elements",
        "Burning Hands",
        "Disguise Self",
        "Mage Armor",
        "Magnify Gravity"
      ],
      "2nd": [
        "Misty Step",
        "Hold Person",
        "Blur",
        "Invisibility",
        "Blindness/Deafness",
        "Snilloc's Snowball Swarm",
        "Rime's Binding Ice",
        "Mirror Image",
        "Aganazzar's Scorcher",
        "Darkvision",
        "See Invisibility",
        "Detect Thoughts"
      ],
      "3rd": [
        "Animate Dead",
        "Fireball",
        "Major Image",
        "Melf's Minute Meteors",
        "Intellect Fortress",
        "Glyph of Warding",
        "Haste",
        "Lightning Bolt"
      ],
      "4th": [
        "Polymorph"
      ],
      "5th": [
        "Hold Monster"
      ],
      "6th": [
        "Permanent Image"
      ],
      "7th": [],
      "8th": [],
      "9th": [],
      "undefined": [
        null
      ]
    },
    "class": {
      "bard": [
        "Light",
        "Hold Person",
        "Hold Monster",
        "Blur",
        "Invisibility",
        "Sleep",
        "Detect Magic",
        "Blindness/Deafness",
        "Polymorph",
        "See Invisibility",
        "Major Image",
        "Permanent Image",
        "Glyph of Warding",
        "Disguise Self",
        "Detect Thoughts"
      ],
      "cleric": [
        "Light",
        "Hold Person",
        "Blur",
        "Detect Magic",
        "Blindness/Deafness",
        "Animate Dead",
        "Glyph of Warding"
      ],
      "druid": [
        "Lightning Streak",
        "Imbue Weapon",
        "Hold Person",
        "Detect Magic",
        "Polymorph",
        "Darkvision",
        "Absorb Elements"
      ],
      "sorcerer": [
        "Misty Step",
        "Fire Bolt",
        "Lightning Streak",
        "Ray of Frost",
        "Light",
        "Imbue Weapon",
        "Shield",
        "Magic Missile",
        "Hold Person",
        "Hold Monster",
        "Blur",
        "Invisibility",
        "Sleep",
        "Detect Magic",
        "Blindness/Deafness",
        "Polymorph",
        "Fireball",
        "Snilloc's Snowball Swarm",
        "Rime's Binding Ice",
        "Mirror Image",
        "Aganazzar's Scorcher",
        "Darkvision",
        "See Invisibility",
        "Major Image",
        "Permanent Image",
        "Melf's Minute Meteors",
        "Intellect Fortress",
        "Glyph of Warding",
        "Haste",
        "Absorb Elements",
        "Burning Hands",
        "Disguise Self",
        "Mage Armor",
        "Detect Thoughts",
        "Lightning Bolt"
      ],
      "warlock": [
        "Misty Step",
        "Eldritch Blast",
        "Fire Bolt",
        "Ray of Frost",
        "Imbue Weapon",
        "Hold Person",
        "Hold Monster",
        "Mirror Image",
        "Darkvision",
        "Major Image",
        "Permanent Image"
      ],
      "wizard": [
        "Misty Step",
        "Fire Bolt",
        "Lightning Streak",
        "Ray of Frost",
        "Light",
        "Imbue Weapon",
        "Shield",
        "Magic Missile",
        "Hold Person",
        "Hold Monster",
        "Blur",
        "Invisibility",
        "Sleep",
        "Detect Magic",
        "Blindness/Deafness",
        "Animate Dead",
        "Polymorph",
        "Fireball",
        "Snilloc's Snowball Swarm",
        "Rime's Binding Ice",
        "Mirror Image",
        "Aganazzar's Scorcher",
        "Darkvision",
        "See Invisibility",
        "Major Image",
        "Permanent Image",
        "Melf's Minute Meteors",
        "Intellect Fortress",
        "Glyph of Warding",
        "Haste",
        "Absorb Elements",
        "Burning Hands",
        "Disguise Self",
        "Mage Armor",
        "Magnify Gravity",
        "Detect Thoughts",
        "Lightning Bolt"
      ]
    },
    "school": {
      "abjuration": [
        "Shield",
        "Intellect Fortress",
        "Glyph of Warding",
        "Absorb Elements",
        "Mage Armor"
      ],
      "conjuration": [
        "Misty Step",
        "Ray of Frost",
        "Light",
        "Rime's Binding Ice"
      ],
      "divination": [
        "Detect Magic",
        "See Invisibility",
        "Detect Thoughts"
      ],
      "enchantment": [
        "Sleep",
        "Hold Person",
        "Hold Monster"
      ],
      "evocation": [
        "Eldritch Blast",
        "Fire Bolt",
        "Lightning Streak",
        "Magic Missile",
        "Burning Hands",
        "Snilloc's Snowball Swarm",
        "Aganazzar's Scorcher",
        "Fireball",
        "Melf's Minute Meteors",
        "Lightning Bolt"
      ],
      "illusion": [
        "Blur",
        "Invisibility",
        "Mirror Image",
        "Major Image",
        "Permanent Image",
        "Disguise Self"
      ],
      "necromancy": [
        "Blindness/Deafness",
        "Animate Dead"
      ],
      "transmutation": [
        "Imbue Weapon",
        "Polymorph",
        "Darkvision",
        "Haste",
        "Magnify Gravity"
      ],
      "undefined": [
        null
      ]
    }
  },
  "items": {
    "data": {
      "Gold Coin": {
        "name": "Gold Coin",
        "image": "asset://eff7e50079eb3dc7713bb48f01102fac",
        "type": "other",
        "subtype": "",
        "description": "A common currency, worth 10 silver coins or 100 copper coins.",
        "weight": 0.01,
        "rarity": "common",
        "price": 1,
        "stackable": true,
        "equippable": false,
        "properties": [
          ""
        ],
        "bonus": {},
        "conditions": [],
        "damage": [],
        "base_armor_class": 0
      },
      "Silver Coin": {
        "name": "Silver Coin",
        "image": "asset://d0df32141e010dfb5d4a8fe801c340b3",
        "type": "other",
        "subtype": "",
        "description": "A common currency, worth a tenth of a gold coin or 10 copper coins.",
        "weight": 0.01,
        "rarity": "common",
        "price": 0.1,
        "stackable": true,
        "equippable": false,
        "properties": [
          ""
        ],
        "bonus": {},
        "conditions": [],
        "damage": [],
        "base_armor_class": 0
      },
      "Copper Coin": {
        "name": "Copper Coin",
        "image": "asset://23e2af3effa9d9cfdf2f639952e31a93",
        "type": "other",
        "subtype": "",
        "description": "A common currency, worth a hundredth of a gold coin or a tenth of a silver coin.",
        "weight": 0.01,
        "rarity": "common",
        "price": 0.01,
        "stackable": true,
        "equippable": false,
        "properties": [
          ""
        ],
        "bonus": {},
        "conditions": [],
        "damage": [],
        "base_armor_class": 0
      },
      "Splint Armor": {
        "name": "Splint Armor",
        "image": "asset://12611d6dda435bd94e3c5d4f609316ca",
        "type": "equipment",
        "subtype": "armor",
        "description": "This armor is made of narrow vertical strips of metal riveted to a backing of leather that is worn over cloth padding. Flexible chain mail protects the joints.",
        "weight": 60,
        "rarity": "common",
        "price": 200,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Heavy"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "17"
      },
      "Chain Mail": {
        "name": "Chain Mail",
        "image": "asset://ca79c1dd6d2a1360c1b38d37770e3f05",
        "type": "equipment",
        "subtype": "armor",
        "description": "Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets.",
        "weight": 55,
        "rarity": "common",
        "price": 75,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Heavy"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "16"
      },
      "Ring Mail": {
        "name": "Ring Mail",
        "image": "asset://eacd9f64c122b7fc359c9e10b314fb4d",
        "type": "equipment",
        "subtype": "armor",
        "description": "This armor is leather armor with heavy rings sewn into it. The rings help reinforce the armor against blows from swords and axes. Ring mail is inferior to chain mail, and it's usually worn only by those who can't afford better armor.",
        "weight": 40,
        "rarity": "common",
        "price": 30,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Heavy"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "14"
      },
      "Plate Armor": {
        "name": "Plate Armor",
        "image": "asset://95534701fa961ef2dc4a674f72d7f6d8",
        "type": "equipment",
        "subtype": "armor",
        "description": "Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
        "weight": 65,
        "rarity": "common",
        "price": 1500,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Heavy"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "19"
      },
      "Half Plate": {
        "name": "Half Plate",
        "image": "asset://a35adfd9d29001ac70bb35ac66f9ac3a",
        "type": "equipment",
        "subtype": "armor",
        "description": "Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps.",
        "weight": 40,
        "rarity": "common",
        "price": 750,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "15"
      },
      "Breastplate": {
        "name": "Breastplate",
        "image": "asset://34785aed1dc9787e022c3dd04ab2c0c0",
        "type": "equipment",
        "subtype": "armor",
        "description": "This armor consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.",
        "weight": 20,
        "rarity": "common",
        "price": 400,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "14"
      },
      "Scale Mail": {
        "name": "Scale Mail",
        "image": "asset://7ea87c319c08b06eaa2981b27953be41",
        "type": "equipment",
        "subtype": "armor",
        "description": "This armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.",
        "weight": 45,
        "rarity": "common",
        "price": 50,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "14"
      },
      "Dragon Scale Mail": {
        "name": "Dragon Scale Mail",
        "image": "asset://cbe55688d285ecc1e945ae7359b693f7",
        "type": "equipment",
        "subtype": "armor",
        "description": "Dragon scale mail is made of the scales of one kind of dragon. Sometimes dragons collect their cast-off scales and gift them to humanoids. Other times, hunters carefully skin and preserve the hide of a dead dragon. In either case, dragon scale mail is highly valued.\n\nWhile wearing this armor, you gain a +1 bonus to AC, you have advantage on saving throws against the Frightful Presence and breath weapons of dragons, and you have a resistance of 30 to one damage type that is determined by the kind of dragon that provided the scales.\n\nAdditionally, you can focus your senses as an action to magically discern the distance direction to the closest dragon within 30 miles of you that is of the same type as the armor.  This special action can't be used again until the next dawn.\n\nThis armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.",
        "weight": 45,
        "rarity": "very rare",
        "price": 5000,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "15"
      },
      "Chain Shirt": {
        "name": "Chain Shirt",
        "image": "asset://1d614439913b710a5d5a06afc5bc50e8",
        "type": "equipment",
        "subtype": "armor",
        "description": "Made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers.",
        "weight": 20,
        "rarity": "common",
        "price": 50,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "13"
      },
      "Hide Armor": {
        "name": "Hide Armor",
        "image": "asset://1ebcad333149eb163656538d9969a6bd",
        "type": "equipment",
        "subtype": "armor",
        "description": "This crude armor consists of thick furs and pelts. It is commonly worn by barbarian tribes, evil humanoids, and other folk who lack access to the tools and materials needed to create better armor.",
        "weight": 12,
        "rarity": "common",
        "price": 10,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Medium"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "12"
      },
      "Studded Leather Armor": {
        "name": "Studded Leather Armor",
        "image": "asset://b9a2848c9bd234858521f15e94758116",
        "type": "equipment",
        "subtype": "armor",
        "description": "Made from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes.",
        "weight": 13,
        "rarity": "common",
        "price": 50,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Light"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "12"
      },
      "Leather Armor": {
        "name": "Leather Armor",
        "image": "asset://072d5f965d283cb68a8b4bc7ccc0cbdc",
        "type": "equipment",
        "subtype": "armor",
        "description": "The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.",
        "weight": 10,
        "rarity": "common",
        "price": 10,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Light"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "11"
      },
      "Padded Armor": {
        "name": "Padded Armor",
        "image": "asset://29511aca9a999dc2a2676fce6564726b",
        "type": "equipment",
        "subtype": "armor",
        "description": "Padded armor consists of quilted layers of cloth and batting.",
        "weight": 10,
        "rarity": "common",
        "price": 5,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Stealth Disadvantage",
          "Light"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [],
        "base_armor_class": "11"
      },
      "Handaxe": {
        "name": "Handaxe",
        "image": "asset://8f066200fd26c49694df9cd01f4bbc74",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 5,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Handaxe",
          "Simple",
          "Light",
          "Thrown"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "6",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 2,
        "base_armor_class": 0
      },
      "Battleaxe": {
        "name": "Battleaxe",
        "image": "asset://edd64b6e28b07aeb2630afa81f37172a",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 4,
        "rarity": "common",
        "price": 10,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Battleaxe",
          "Martial",
          "Versatile"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 4,
        "base_armor_class": 0
      },
      "Greataxe": {
        "name": "Greataxe",
        "image": "asset://0cb0dd2199fd7efd93103c39e8a7c3e6",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 7,
        "rarity": "common",
        "price": 30,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Greataxe",
          "Martial",
          "Heavy",
          "Two-handed"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "12",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 7,
        "base_armor_class": 0
      },
      "Dagger": {
        "name": "Dagger",
        "image": "asset://4df77858025ff60e7b7909984ccc7646",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 1,
        "rarity": "common",
        "price": 2,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Dagger",
          "Mundane",
          "Finesse",
          "Light",
          "Thrown"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "4",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 1,
        "base_armor_class": 0
      },
      "Shortsword": {
        "name": "Shortsword",
        "image": "asset://c87a5e177a34318d6d09512cdcf34335",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 10,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Shortsword",
          "Martial",
          "Finesse",
          "Light"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "6",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 2,
        "base_armor_class": 0
      },
      "Scimitar": {
        "name": "Scimitar",
        "image": "asset://67aac5307fe8ed2107b14db0c68d9812",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 3,
        "rarity": "common",
        "price": 25,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Scimitar",
          "Martial",
          "Finesse",
          "Light"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "6",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 3,
        "base_armor_class": 0
      },
      "Rapier": {
        "name": "Rapier",
        "image": "asset://6ca0fe606b85c79d4d3de792fcb7e98a",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 25,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Rapier",
          "Martial",
          "Finesse"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 2,
        "base_armor_class": 0
      },
      "Longsword": {
        "name": "Longsword",
        "image": "asset://36204064dbd1d4b08a4f367c1fb995ba",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 3,
        "rarity": "common",
        "price": 15,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Longsword",
          "Martial",
          "Versatile"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 3,
        "base_armor_class": 0
      },
      "Greatsword": {
        "name": "Greatsword",
        "image": "asset://d3f1ce77fd97886d03dbe05424dea580",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 6,
        "rarity": "common",
        "price": 50,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Greatsword",
          "Martial",
          "Heavy",
          "Two-handed"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "2",
            "die_size": "6",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 6,
        "base_armor_class": 0
      },
      "Javelin": {
        "name": "Javelin",
        "image": "asset://cabc4bee946453eecaaa27cd7584e799",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 0.5,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Javelin",
          "Simple",
          "Thrown"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "6",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 2,
        "base_armor_class": 0
      },
      "Spear": {
        "name": "Spear",
        "image": "asset://c393bce89a40769ba522aecbe081f0ca",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 3,
        "rarity": "common",
        "price": 1,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Spear",
          "Simple",
          "Thrown",
          "Versatile"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 3,
        "base_armor_class": 0
      },
      "Glaive": {
        "name": "Glaive",
        "image": "asset://9c7e7317c713007e688eba82f043bf3a",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 6,
        "rarity": "common",
        "price": 20,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Glaive",
          "Martial",
          "Heavy",
          "Two-handed",
          "Reach"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "10",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 6,
        "base_armor_class": 0
      },
      "Halberd": {
        "name": "Halberd",
        "image": "asset://d549596e555cb6b730ab39857f83c851",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 6,
        "rarity": "common",
        "price": 20,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Halberd",
          "Martial",
          "Heavy",
          "Two-handed",
          "Reach"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "10",
            "damage_type": "Slashing"
          }
        ],
        "recovery": 6,
        "base_armor_class": 0
      },
      "Light hammer": {
        "name": "Light hammer",
        "image": "asset://b731535e2eb74a0533151ac9973f7ed8",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 2,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Light hammer",
          "Simple",
          "Light",
          "Thrown"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "4",
            "damage_type": "Bludgeoning"
          }
        ],
        "recovery": 2,
        "base_armor_class": 0
      },
      "Warhammer": {
        "name": "Warhammer",
        "image": "asset://bdbcb5043831fdf7483bad8436355dad",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 5,
        "rarity": "common",
        "price": 15,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Warhammer",
          "Martial",
          "Versatile"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Bludgeoning"
          }
        ],
        "recovery": 5,
        "base_armor_class": 0
      },
      "Maul": {
        "name": "Maul",
        "image": "asset://bb71c3736454bbf7344e655c4c6d5243",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 10,
        "rarity": "common",
        "price": 10,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Maul",
          "Martial",
          "Heavy",
          "Two-handed"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "2",
            "die_size": "6",
            "damage_type": "Bludgeoning"
          }
        ],
        "recovery": 10,
        "base_armor_class": 0
      },
      "Shortbow": {
        "name": "Shortbow",
        "image": "asset://93f2a7e2abe3c20bf3d09b0988278267",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 2,
        "rarity": "common",
        "price": 25,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Ammunition",
          "Two-handed"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "6",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 4,
        "base_armor_class": 0
      },
      "Longbow": {
        "name": "Longbow",
        "image": "asset://c160bb41e7be28f23896666f2cc39fdb",
        "type": "equipment",
        "subtype": "weapon",
        "description": "",
        "weight": 3,
        "rarity": "common",
        "price": 50,
        "stackable": false,
        "equippable": true,
        "properties": [
          "Ammunition",
          "Two-handed"
        ],
        "bonus": "",
        "conditions": "",
        "damage": [
          {
            "die_ammount": "1",
            "die_size": "8",
            "damage_type": "Piercing"
          }
        ],
        "recovery": 6,
        "base_armor_class": 0
      }
    },
    "type": {
      "equipment": [
        "Splint Armor",
        "Chain Mail",
        "Ring Mail",
        "Plate Armor",
        "Half Plate",
        "Breastplate",
        "Scale Mail",
        "Dragon Scale Mail",
        "Chain Shirt",
        "Hide Armor",
        "Studded Leather Armor",
        "Leather Armor",
        "Padded Armor",
        "Handaxe",
        "Battleaxe",
        "Greataxe",
        "Dagger",
        "Shortsword",
        "Scimitar",
        "Rapier",
        "Longsword",
        "Greatsword",
        "Javelin",
        "Spear",
        "Glaive",
        "Halberd",
        "Light hammer",
        "Warhammer",
        "Maul",
        "Shortbow",
        "Longbow"
      ],
      "undefined": [],
      "other": [
        "Gold Coin",
        "Silver Coin",
        "Copper Coin"
      ]
    }
  }
}